readme.org
#+TITLE:    My Emacs Configuration
#+AUTHOR:   Rubens.TS
#+DATE:     2018-03-22
#+EMAIL:    rubensts@gmail.com
#+LANGUAGE: en
#+PROPERTY: header-args :results silent :comments link :tangle ./init.el
#+OPTIONS: author:nil date:nil toc:2 title:nil e:nil

* About

*ATTENTION:* This is a work in progress...and which dotemacs isn't? ;)

This repository contains the setup I use to customize Emacs. It is implemented trying to
follow the concept of [[http://orgmode.org/worg/org-contrib/babel/intro.html#literate-programming][Literate Programming]] through the use of [[http://orgmode.org/][Org-mode]] and [[http://orgmode.org/worg/org-contrib/babel/][Org-Babel]] to
manage all the settings in a unique Org-mode file.

* Contents                                                              :toc:
- [[#about][About]]
- [[#details][Details]]
  - [[#dependencies][Dependencies]]
  - [[#source-of-ideas][Source of Ideas]]
  - [[#installation][Installation]]
- [[#initial-setup][Initial Setup]]
  - [[#lexical-binding][Lexical binding]]
  - [[#disable-packageel][Disable package.el]]
  - [[#repositories][Repositories]]
  - [[#garbage-collector][Garbage collector]]
  - [[#package-management][Package management]]
  - [[#server][Server]]
  - [[#packages][Packages]]
- [[#core][Core]]
  - [[#generate-initel][Generate init.el]]
  - [[#built-in-capabilities][Built-in Capabilities]]
- [[#keybindings][Keybindings]]
  - [[#generalel][general.el]]
  - [[#hydra][hydra]]
  - [[#which-key][which-key]]
- [[#main-packages][Main packages]]
  - [[#org][org]]
  - [[#ivy][ivy]]
  - [[#projectile][projectile]]
- [[#base-packages][Base packages]]
  - [[#alert][alert]]
  - [[#anzu][anzu]]
  - [[#async][async]]
  - [[#bookmarks][bookmarks]]
  - [[#easy-kill][easy-kill]]
  - [[#ediff][ediff]]
  - [[#esup][esup]]
  - [[#fill-column-indicator][fill-column-indicator]]
  - [[#fixmee][fixmee]]
  - [[#flx][flx]]
  - [[#flycheck][flycheck]]
  - [[#graphviz-dot-mode][graphviz-dot-mode]]
  - [[#page-break-lines][page-break-lines]]
  - [[#paradox][paradox]]
  - [[#pass][pass]]
  - [[#pcache][pcache]]
  - [[#recentf][recentf]]
  - [[#restart-emacs][restart-emacs]]
  - [[#ripgrep][ripgrep]]
  - [[#uniquify][uniquify]]
  - [[#undo-tree][undo-tree]]
  - [[#volatile-highlights][volatile-highlights]]
  - [[#wgrep][wgrep]]
- [[#window-management][Window Management]]
  - [[#eyebrowse][eyebrowse]]
  - [[#perspective][perspective]]
  - [[#shackle][shackle]]
- [[#navigation][Navigation]]
  - [[#ace-link][ace-link]]
  - [[#ace-window][ace-window]]
  - [[#avy][avy]]
- [[#version-control][Version Control]]
  - [[#magit][magit]]
  - [[#git-gutter][git-gutter]]
  - [[#git-timemachine][git-timemachine]]
- [[#programming][Programming]]
  - [[#general-settings][General settings]]
  - [[#company][company]]
  - [[#language-server-protocol][language server protocol]]
  - [[#snippets][snippets]]
  - [[#text-notation][text notation]]
  - [[#languages][languages]]
- [[#devops][Devops]]
  - [[#eshell][eshell]]
  - [[#tramp][tramp]]
  - [[#ansible][ansible]]
  - [[#docker][docker]]
  - [[#puppet][puppet]]
  - [[#vagrant][vagrant]]
  - [[#ztree][ztree]]
- [[#tools][Tools]]
  - [[#dired---directory-editing-and-navigation][dired - Directory Editing and Navigation]]
  - [[#define-word][define-word]]
  - [[#powerthesaurus][powerthesaurus]]
  - [[#irc-internet-relay-chat][IRC (Internet Relay Chat)]]
  - [[#spell-and-grammar-checking][Spell and grammar checking]]
  - [[#pdf-tools][pdf-tools]]
- [[#appearance][Appearance]]
  - [[#themes][Themes]]
  - [[#modeline][Modeline]]
  - [[#fonts][Fonts]]
- [[#enhancements][Enhancements]]
  - [[#beacon][beacon]]
  - [[#crux][crux]]
  - [[#expand-region][expand-region]]
  - [[#multiple-cursors][multiple-cursors]]
  - [[#zop-to-char][zop-to-char]]

* Details
** Dependencies

This is a list of applications that need to be installed previously in order to
enjoy all the goodies of this configuration. Of course, you can install only the
ones you will really use and/or adapt it to the ones you prefer.

- [[https://git-scm.com/][git]] for version control, but if you are here you already know what is it ;)
- [[https://github.com/BurntSushi/ripgrep][ripgrep]] for fast searching
- [[https://notmuchmail.org/][notmuch]] for email (also a tool to fetch mail like [[http://isync.sourceforge.net/][mbsync]] or [[http://www.offlineimap.org/][OfflineImap]])
- [[https://www.gnupg.org/][GnuPG]] for security, always
- [[https://www.passwordstore.org/][password-store]] to manage your passwords
- [[https://www.latex-project.org/][LaTeX]] and [[http://pygments.org/][Pygments]] to PDF export with syntax highlighting
- [[https://mupdf.com/][MuPDF]] for DocView, [[https://poppler.freedesktop.org/][poppler]] for pdf-tools
- [[http://pandoc.org/][pandoc]] for [[https://github.com/kawabata/ox-pandoc][ox-pandoc]]
- [[http://proselint.com/][proselint]] a liter for prose
- [[http://www.gzip.org/][gzip]]
- [[https://www.imagemagick.org/script/index.php][ImageMagick]] or [[http://www.graphicsmagick.org/][GraphicsMagick]]

** Source of Ideas

The inspiration for handling the Emacs configuration through [[http://orgmode.org/worg/org-contrib/babel/intro.html#literate-programming][Literate Programming]] came
from [[http://eschulte.github.io/emacs24-starter-kit/][Eric Schulte's emacs24-starter-kit]]. It is a really clever concept that, among other
things, keeps your Emacs configuration tidy and well organized.

The first time I saw it being handled by a single org-mode file was on [[https://github.com/sachac/.emacs.d/blob/gh-pages/Sacha.org][Sacha Chua's
config.]] Then I came across [[https://github.com/joedicastro/dotfiles/tree/master/emacs/.emacs.d][joe di castro's emacs.d on github]], where he automatically
generates the =~/.emacs.d/init.el= directly from his =readme.org= file. This is the solution
I'm using here.

A list of Emacs Jedis, from whon I took most of the solutions applied here. Their ~github~
pages have many interesting/clever ideas to inspire you. Also make sure to check their
blogs as well...cool stuff ;)

- [[https://github.com/sachac/.emacs.d/blob/gh-pages/Sacha.org][Sacha Chua]]
- [[https://github.com/joedicastro/dotfiles/tree/master/emacs][joedicastro]]
- [[https://github.com/abo-abo/oremacs][oremacs (abo-abo)]]
- [[https://github.com/angrybacon/dotemacs][angrybacon]]
- [[https://github.com/emacs-tw/awesome-emacs#interface-enhancement][awesome-emacs]]

** Installation

I don't recommend you to use this Emacs configuration before reading it and understanding
what it does. Actually, this advice is serves for anything you find on the Interwebs ;)

In case you want to try it out, first rename your current =~/.emacs.d= directory, so you can
keep it safe for when you want to get back to it:

#+BEGIN_SRC sh :tangle no
$ mv ~/.emacs.d ~/.emacs.d.disabled
#+END_SRC

Then clone this repository. It will create a new =~/.emacs.d= directory:

#+BEGIN_SRC sh :tangle no
$ git clone https://github.com/rubensts/.emacs.d.git
#+END_SRC

Code blocks on org mode can be tangled with =C-c C-v t=. This is not necessary in this
=readme.org= file as the tangling is done automatically when this file (=readme.org)= is
saved.

*** If using it on MacOS

For installing Emacs on MacOS, check these:

- [[http://emacs.stackexchange.com/questions/271/what-is-the-difference-between-aquamacs-and-other-mac-versions-of-emacs][Difference between Emacs versions on mac]]
- [[https://emacs.stackexchange.com/questions/37240/how-install-emacs-26-mac][Emacs 26 on macOS]]

* Initial Setup
** Lexical binding

In accordance with the [[https://github.com/bbatsov/emacs-lisp-style-guide#source-code-layout--organization][emacs-lisp-style-guide]].

#+begin_src emacs-lisp :comments no :cond-case no :padline no
;;; -*- lexical-binding: t -*-
#+end_src

** Disable package.el

Prevent =package.el= from modifying this file if the rest of the init fails.

#+begin_src emacs-lisp
;;(setq package-enable-at-startup nil)
;;(require 'package)
#+end_src

** Repositories

Sets the ELPA repositories from where the packages are fetched. Also, by default
=package-initialize= is called after =init.el=, but it has to be called here because some
packages listed depend on it.

#+begin_src emacs-lisp
(setq package-archives '(("org"   . "https://orgmode.org/elpa/")
                         ("melpa" . "https://melpa.org/packages/")
                         ("gnu"   . "https://elpa.gnu.org/packages/")))
(package-initialize)
#+end_src

** Garbage collector

To improve Emacs' startup time, increase the garbage-collector memory threshold to 400MB
(default is 800KB). Also set =file-name-handler-alist= to nil to avoid some filenames checks
that are not necessary during the startup.

#+begin_src emacs-lisp
;;(let ((my/file-name-handler-alist file-name-handler-alist))
;;
;;  (setq gc-cons-threshold (* 400 1024 1024)
;;        file-name-handler-alist nil)
;;
;;  ;; make sure to reset the variables after init.
;;  (add-hook 'after-init-hook
;;            (lambda ()
;;              (setq gc-cons-threshold (* 20 1024 1024)
;;                    file-name-handler-alist my/file-name-handler-alist))))
#+end_src

Also, when the minibuffer is opened, the garbage-collector is temporarily increased to a
point that will prevent it to happen, immediatelly getting back to normal after the
minibuffer is closed. Great tip from [[https://bling.github.io/blog/2016/01/18/why-are-you-changing-gc-cons-threshold/][Bailey Ling blog]].

#+begin_src emacs-lisp
;;(defun my-minibuffer-setup-hook ()
;;  (setq gc-cons-threshold most-positive-fixnum))
;;
;;(defun my-minibuffer-exit-hook ()
;;  (setq gc-cons-threshold (* 20 1024 1024)))
;;
;;(add-hook 'minibuffer-setup-hook #'my-minibuffer-setup-hook)
;;(add-hook 'minibuffer-exit-hook #'my-minibuffer-exit-hook)
#+end_src

** Package management

To manage packages and their configuration in a neat way. It gives a concise and powerful
way to organize Emacs configuration avoiding the terrible [[https://www.emacswiki.org/emacs/DotEmacsBankruptcy][.emacs bankruptcy]].

In this configuration it is set to work together with [[https://github.com/raxod502/straight.el][straight]].

Also, ~use-package~ supports [[https://www.emacswiki.org/emacs/key-chord.el][key-chord]] bindings declarations through the *:chords* keyword.

#+BEGIN_SRC emacs-lisp
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  (eval-when-compile
    (require 'use-package)
    (setq-default use-package-always-ensure t))

  (use-package use-package-chords
    :config (key-chord-mode 1))
#+END_SRC

** Server

Initialize Emacs server in case it is not already running.

This makes startup time irrelevant. Start emacs once, connect with emacsclient every other
time. See [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Emacs-Server.html#Emacs-Server][Using Emacs as a Server]].

#+begin_src emacs-lisp
(use-package server
  :config
  (unless (server-running-p)
    (server-start)))
#+end_src

** Packages

Packages required initially.

#+BEGIN_SRC emacs-lisp
;; keeps ~/.emacs.d clean
(use-package no-littering
  :config
  (setq auto-save-file-name-transforms
        `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
  (setq custom-file (no-littering-expand-etc-file-name "custom.el")))

(use-package s)  ; required library
(use-package f)  ; required library
(use-package bind-key)   ; to use :bind (and variants) with use-package
(use-package validate)
#+END_SRC

* Core
** Generate init.el

The code block below is the responsible for creating the hook that will tangle a new
=~/.emacs.d/init.el= every time that this =readme.org= is saved. This also means that
alterations on the configuration have to be done in =readme.org=. Any changes made in
=~/.emacs.d/init.el= will be overwritten when =readme.org= is saved.

#+BEGIN_SRC emacs-lisp
(defun my/tangle-init ()
  "Tangles readme.org and byte compiles ~/.emacs.d/"
  (interactive)
  (when (equal (buffer-name)
               (concat "readme.org"))
    (org-babel-tangle)
    ;; byte compile the .emacs.d directory
    ;;(byte-recompile-directory (expand-file-name user-emacs-directory) 0)
    ))

(add-hook 'after-save-hook 'my/tangle-init)
;;(add-hook 'kill-emacs-hook 'my/tangle-init)
#+END_SRC

** Built-in Capabilities
*** OS compatibility

 Check which OS is hosting Emacs for keeping compatibility.

 #+BEGIN_SRC emacs-lisp
 (defun system-is-mac ()
   (interactive)
   (string-equal system-type "darwin"))

 (defun system-is-linux ()
   (interactive)
   (string-equal system-type "gnu/linux"))
 #+END_SRC

