init.el
;;; -*- lexical-binding: t -*-

;; [[file:~/.emacs.d/readme.org::*Disable%20package.el][Disable package.el:1]]
;;(setq package-enable-at-startup nil)
;;(require 'package)
;; Disable package.el:1 ends here

;; [[file:~/.emacs.d/readme.org::*Repositories][Repositories:1]]
(setq package-archives '(("org"   . "https://orgmode.org/elpa/")
                         ("melpa" . "https://melpa.org/packages/")
                         ("gnu"   . "https://elpa.gnu.org/packages/")))
(package-initialize)
;; Repositories:1 ends here

;; [[file:~/.emacs.d/readme.org::*Garbage%20collector][Garbage collector:1]]
;;(let ((my/file-name-handler-alist file-name-handler-alist))
;;
;;  (setq gc-cons-threshold (* 400 1024 1024)
;;        file-name-handler-alist nil)
;;
;;  ;; make sure to reset the variables after init.
;;  (add-hook 'after-init-hook
;;            (lambda ()
;;              (setq gc-cons-threshold (* 20 1024 1024)
;;                    file-name-handler-alist my/file-name-handler-alist))))
;; Garbage collector:1 ends here

;; [[file:~/.emacs.d/readme.org::*Garbage%20collector][Garbage collector:2]]
;;(defun my-minibuffer-setup-hook ()
;;  (setq gc-cons-threshold most-positive-fixnum))
;;
;;(defun my-minibuffer-exit-hook ()
;;  (setq gc-cons-threshold (* 20 1024 1024)))
;;
;;(add-hook 'minibuffer-setup-hook #'my-minibuffer-setup-hook)
;;(add-hook 'minibuffer-exit-hook #'my-minibuffer-exit-hook)
;; Garbage collector:2 ends here

;; [[file:~/.emacs.d/readme.org::*Package%20management][Package management:1]]
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  (eval-when-compile
    (require 'use-package)
    (setq-default use-package-always-ensure t))

  (use-package use-package-chords
    :config (key-chord-mode 1))
;; Package management:1 ends here

;; [[file:~/.emacs.d/readme.org::*Server][Server:1]]
(use-package server
  :config
  (unless (server-running-p)
    (server-start)))
;; Server:1 ends here

;; [[file:~/.emacs.d/readme.org::*Packages][Packages:1]]
;; keeps ~/.emacs.d clean
(use-package no-littering
  :config
  (setq auto-save-file-name-transforms
        `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
  (setq custom-file (no-littering-expand-etc-file-name "custom.el")))

(use-package s)  ; required library
(use-package f)  ; required library
(use-package bind-key)   ; to use :bind (and variants) with use-package
(use-package validate)
;; Packages:1 ends here

;; [[file:~/.emacs.d/readme.org::*Generate%20init.el][Generate init.el:1]]
(defun my/tangle-init ()
  "Tangles readme.org and byte compiles ~/.emacs.d/"
  (interactive)
  (when (equal (buffer-name)
               (concat "readme.org"))
    (org-babel-tangle)
    ;; byte compile the .emacs.d directory
    ;;(byte-recompile-directory (expand-file-name user-emacs-directory) 0)
    ))

(add-hook 'after-save-hook 'my/tangle-init)
;;(add-hook 'kill-emacs-hook 'my/tangle-init)
;; Generate init.el:1 ends here

;; [[file:~/.emacs.d/readme.org::*OS%20compatibility][OS compatibility:1]]
 (defun system-is-mac ()
   (interactive)
   (string-equal system-type "darwin"))

 (defun system-is-linux ()
   (interactive)
   (string-equal system-type "gnu/linux"))
;; OS compatibility:1 ends here

;; [[file:~/.emacs.d/readme.org::*Better%20defaults][Better defaults:1]]
;; Fullscreen
