init.el
(cond ((system-is-mac) (toggle-frame-fullscreen))
      ((system-is-linux) (add-to-list 'default-frame-alist
                                        '(fullscreen . maximized))))

;; better defaults
;;(menu-bar-mode -1)
;;(when (fboundp 'tool-bar-mode)
;;  (tool-bar-mode -1))
;;(when (fboundp 'scroll-bar-mode)
;;  (scroll-bar-mode -1))
;;(when (fboundp 'horizontal-scroll-bar-mode)
;;  (horizontal-scroll-bar-mode -1))
;;
;;(global-set-key (kbd "M-/") 'hippie-expand)
;;(global-set-key (kbd "C-x C-b") 'ibuffer)

(fset 'yes-or-no-p 'y-or-n-p)                  ; ask `y/n?` instead of `yes/no?`
(transient-mark-mode t)                        ; apply changes to highlighted region
(delete-selection-mode t)                      ; overwrite selected text when typing
(blink-cursor-mode -1)                         ; turn off the blinking cursor
(global-font-lock-mode t)                      ; always highlight code
(global-auto-revert-mode t)                    ; refresh buffers when files change
(global-hl-line-mode 1)                        ; highlight the current line
(global-visual-line-mode t)                    ; break long line of text
(global-prettify-symbols-mode 1)               ; prettify symbols (lambdas, etc)
(column-number-mode t)                         ; shows column number on the modeline
(save-place-mode t)                            ; save cursor position for opened files
(show-paren-mode t)                            ; show matching parentheses
(winner-mode 1)                                ; allow to get back to previous window configuration

(defalias 'list-buffers 'ibuffer)              ; use ibuffer by default

(set-terminal-coding-system  'utf-8)           ; make sure that UTF-8 is used everywhere
(set-keyboard-coding-system  'utf-8)
;;(set-language-environment    'utf-8)
(set-language-environment   "UTF-8")
(set-default-coding-systems  'utf-8)
(set-selection-coding-system 'utf-8)
(setq locale-coding-system   'utf-8)
(prefer-coding-system        'utf-8)
(set-input-method nil)

(validate-setq load-prefer-newer t             ; avoid using outdated compiled files
               inhibit-default-init t          ; don't call default.el (default settings) after init.el
               inhibit-startup-message t       ; don't show startup message
               initial-major-mode 'org-mode    ; set scratch buffer automatically to org-mode
               initial-scratch-message nil     ; clear the inital message on the scratch buffer

               mouse-yank-at-point t           ; paste from clipboard to where point is on buffer
               echo-keystrokes 0.1             ; shows keystrokes in progress
               use-dialog-box nil              ; don't use dialog when using mouse click
               line-spacing '0.10              ; line height
               ;;auto-revert-verbose nil         ; turn off auto revert messages in the minibuffer
               default-directory "~/"          ; start searching from home directory when opening files
               vc-follow-symlinks t            ; when opening a file, always follow symlinks
               sentence-end-double-space nil   ; a sentence shouldn't have two spaces after period
               require-final-newline t         ; ensure files end with newline
               confirm-kill-emacs 'y-or-n-p    ; ask for confirmation to close Emacs
               auto-revert-verbose nil         ; turn off auto revert messages in the minibuffer
               ;;size-indication-mode t          ; displays the buffer size in the modeline
               show-paren-delay 0.0            ; set delay to 0 for showing matching parens
               auto-window-vscroll nil         ; reduce lag when using next-line
               save-interprogram-paste-before-kill t)

(setq apropos-do-all t)                        ; perform more extensive searches than default
(setq-default indicate-empty-lines t)          ; show empty lines at bottom of buffer
(setq-default ffap-machine-p-known 'reject)    ; stop pinging the host at point when C-x C-f a file

(setq-default indent-tabs-mode nil             ; always indent with spaces
              default-tab-width 2
              c-basic-offset 4
              fill-column 90)                  ; set default line length

;;; hooks
(add-hook 'before-save-hook 'delete-trailing-whitespace)  ; delete trailing whitespace when buffer is saved
(add-hook 'prog-mode-hook 'subword-mode)                  ; treat CamelCaseSubWords as separate words

;; when saving a file that starts with `#!', make it executable
(add-hook 'after-save-hook
          'executable-make-buffer-file-executable-if-script-p)
;; Better defaults:1 ends here

;; [[file:~/.emacs.d/readme.org::*MacOS%20specifics][MacOS specifics:1]]
(use-package exec-path-from-shell
  :if (and (eq system-type 'darwin) (display-graphic-p))
  :config
  (progn
    (when (string-match-p "/zsh$" (getenv "SHELL"))
      (validate-setq exec-path-from-shell-arguments '("-l")))
    (exec-path-from-shell-initialize)))

(when (system-is-mac)
  (setq ns-function-modifier      'hyper ; set fn key to hyper key  (fn = hyper)
        ns-right-command-modifier 'hyper ; set right command key to hyper (control = hyper)
        ns-command-modifier       'meta  ; set command key to meta  (command = meta)
        ns-option-modifier        'super ; set option key to super  (option = super)
        ns-pop-up-frames nil)       ; open file on current buffer when double-clicking it on Mac Finder

  (defun my/swap-meta-and-super ()
    "Swap the mapping of Meta and Super.
Very useful for people using their Mac with a
Windows external keyboard from time to time."
    (interactive)
    (if (eq mac-command-modifier 'super)
        (progn
          (setq mac-command-modifier 'meta)
          (setq mac-option-modifier 'super)
          (message "Command is now bound to META and Option is bound to SUPER."))
      (progn
        (setq mac-command-modifier 'super)
        (setq mac-option-modifier 'meta)
        (message "Command is now bound to SUPER and Option is bound to META."))))
  )
;; MacOS specifics:1 ends here

;; [[file:~/.emacs.d/readme.org::*Location][Location:1]]
(setq calendar-week-start-day  1
      calendar-latitude 43.8
      calendar-longitude 11.0
      calendar-location-name "Prato, Italy")
;; Location:1 ends here

;; [[file:~/.emacs.d/readme.org::*Holidays][Holidays:1]]
(setq holiday-general-holidays
      '((holiday-fixed 1 1 "Capodanno")
        (holiday-fixed 5 1 "1 Maggio")
        (holiday-fixed 4 25 "Liberazione")
        (holiday-fixed 6 2 "Festa Repubblica")
        ))

(setq holiday-christian-holidays
      '((holiday-fixed 12 8 "Immacolata Concezione")
        (holiday-fixed 12 25 "Natale")
        (holiday-fixed 12 26 "Santo Stefano")
        (holiday-fixed 1 6 "Epifania")
        (holiday-easter-etc -52 "Giovedì grasso")
        (holiday-easter-etc -47 "Martedì grasso")
        (holiday-easter-etc  -2 "Venerdì Santo")
        (holiday-easter-etc   0 "Pasqua")
        (holiday-easter-etc  +1 "Lunedì Pasqua")
        (holiday-fixed 8 15 "Assunzione di Maria")
        (holiday-fixed 11 1 "Ognissanti")
        ))
;; Holidays:1 ends here
