readme.org
*** History

Maintain a history of past actions and a reasonable number of lists.

#+BEGIN_SRC emacs-lisp
(setq-default history-length 1000
              history-delete-duplicates t
              savehist-save-minibuffer-history 1
              savehist-additional-variables '(kill-ring
                                              search-ring
                                              regexp-search-ring))
(savehist-mode t)
#+END_SRC

*** Scrolling

#+BEGIN_SRC emacs-lisp
(setq scroll-margin 0
      scroll-conservatively 100000
      scroll-preserve-screen-position 1
      mouse-wheel-scroll-amount '(1 ((shift) . 1))
      mouse-wheel-progressive-speed nil
      mouse-wheel-follow-mouse 't)
#+END_SRC

*** Useful functions

These functions are useful. Activate them.

#+BEGIN_SRC emacs-lisp
(put 'downcase-region 'disabled nil)
(put 'upcase-region 'disabled nil)
(put 'narrow-to-region 'disabled nil)
(put 'narrow-to-page 'disabled nil)
#+END_SRC

*** Custom functions
**** Split window and move

This improves the default Emacs behavior of split windows. The cursor
automatically moves to the new splited window.

#+BEGIN_SRC emacs-lisp
  (defun split-below-and-move ()
    (interactive)
    (split-window-below)
    (other-window 1))

  (defun split-right-and-move ()
    (interactive)
    (split-window-right)
    (other-window 1))

  (bind-keys ("C-x 2" . split-below-and-move)
             ("C-x 3" . split-right-and-move))
#+END_SRC

**** Kill the current buffer

Change the key-binding to kill the current buffer instead of asking which one to
kill. Very good tip taken from [[http://pragmaticemacs.com/emacs/dont-kill-buffer-kill-this-buffer-instead/][Pragmaticemacs]].

#+BEGIN_SRC emacs-lisp
(defun my/kill-this-buffer ()
  "Kill the current buffer."
  (interactive)
  (kill-buffer (current-buffer)))

(global-set-key (kbd "C-x k") 'my/kill-this-buffer)
#+END_SRC

**** Improved kill-word

The default behaviour of the ~kill-word~ function is to delete characters from the current
cursor position to the end of the word. I prefer if it would behave similarly to Vim's
=ciw=, so let's create a function to accomplish just that, after all, this is Emacs! ;)

Found this function, as ~copy-word~ and ~copy-line~ on [[https://github.com/daedreth/UncleDavesEmacs#improved-kill-word][Uncle Daves' .emacs]].

#+begin_src emacs-lisp
(defun my/kill-word ()
  "Kill the entire word your cursor is in. Equivalent to 'ciw' in vim."
  (interactive)
  (forward-char 1)
  (backward-word)
  (kill-word 1))

(global-set-key (kbd "H-d w") 'my/kill-word)
#+end_src

**** Improved copy-word

And again, the same as above but we make sure to not delete the source word.

#+begin_src emacs-lisp
(defun my/copy-word ()
  "Copy the whole word your cursor is in."
  (interactive)
  (save-excursion (forward-char 1)
                  (backward-word)
                  (kill-word 1)
                  (yank)))

(global-set-key (kbd "H-c w") 'my/copy-word)
#+end_src

**** Copy a line

Regardless of where your cursor is, this quickly copies a line.

#+begin_src emacs-lisp
(defun my/copy-line ()
  "Copies a line regardless the cursor position."
  (interactive)
  (save-excursion (kill-new
                   (buffer-substring
                    (point-at-bol)
                    (point-at-eol)))))

(global-set-key (kbd "H-c l") 'my/copy-line)
#+end_src

**** Org header IDs

#+BEGIN_SRC emacs-lisp
  (defun my/copy-id-to-clipboard()
    "Copy the ID property value to killring,
  if no ID is there then create a new unique ID.
  This function works only in org-mode buffers.

  The purpose of this function is to easily construct id:-links to
  org-mode items. If its assigned to a key it saves you marking the
  text and copying to the killring."
         (interactive)
         (when (eq major-mode 'org-mode) ; do this only in org-mode buffers
       (setq mytmpid (funcall 'org-id-get-create))
       (kill-new mytmpid)
       (message "Copied %s to killring (clipboard)" mytmpid)
         ))

  (global-set-key (kbd "<f5>") 'my/copy-id-to-clipboard)
#+END_SRC

**** Create parent directories when saving file

Copied from [[https://github.com/hrs/sensible-defaults.el][sensible-defaults.el]].

#+BEGIN_SRC emacs-lisp
(defun sensible-defaults/offer-to-create-parent-directories-on-save ()
  "When saving a file in a directory that doesn't exist, offer
to (recursively) create the file's parent directories."
  (add-hook 'before-save-hook
            (lambda ()
              (when buffer-file-name
                (let ((dir (file-name-directory buffer-file-name)))
                  (when (and (not (file-exists-p dir))
                             (y-or-n-p (format "Directory %s does not exist. Create it?" dir)))
                    (make-directory dir t)))))))
#+END_SRC

* Keybindings
** general.el

[[https://github.com/noctuid/general.el][general.el]] is the best solution for managing key definitions on Emacs.

#+BEGIN_SRC emacs-lisp
  (use-package general
    :config
    (general-define-key
     :prefix "H-SPC"
     ;; applications
     "a" '(:ignore t :which-key "Applications")
     "ad" 'dired-jump
     "am" 'notmuch
     "ag" 'magit-status

     ;; buffers
     "b" '(:ignore t :which-key "Buffers")
     "bb" 'switch-to-buffer
     "bd" 'kill-this-buffer
     "by" 'copy-whole-buffer

     ;; ;; files
     "f" '(:ignore t :which-key "Files")
     "ff" 'find-file
     "fl" 'load-file
     "fs" 'save-buffer

  ;; edit text
     "e" '(:ignore t :which-key "Edit")
     "em" 'hydra-mc/body

     ;; ;; spelling
     "s" '(:ignore t :which-key "Spelling")
     "sb" 'flyspell-buffer
     "sd" 'switch-dictionary
     "sn" 'flyspell-goto-next-error
     "sp" 'flyspell-popup-correct
     "sw" 'flyspell-auto-correct-word
     "sz" 'flyspell-lazy-check-buffer

     ;; modes
     "m" '(:ignore t :which-key "Modes")
     "ml" 'global-display-line-numbers-mode
     "mw" 'whitespace-mode)

    (general-define-key
     :keymaps 'dired-mode-map
     :prefix ","
     "&" 'dired-do-async-shell-command
     "s" 'dired-get-size
     "_" 'xah-dired-rename-space-to-underscore
     "-" 'xah-dired-rename-space-to-hyphen))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no
   "/"   'counsel-ag
   "iu"  'insert-char
   "ne"  'flycheck-next-error
   "pe"  'flycheck-previous-error
   "qq"  'save-buffers-kill-emacs
   "cy"  'clipboard-kill-ring-save
   ;;"cp" 'clipboard-yank
   "k" 'my/swap-meta-and-super

   ;; evil-nerd-commenter
   "ci" 'evilnc-comment-or-uncomment-lines
   "cl" 'evilnc-quick-comment-or-uncomment-to-the-line
   "cc" 'evilnc-copy-and-comment-lines
   "cp" 'evilnc-comment-or-uncomment-paragraphs
   "cr" 'comment-or-uncomment-region
   "cv" 'evilnc-toggle-invert-comment-line-by-line
   "."  'evilnc-copy-and-comment-operator
#+END_SRC

** [[https://github.com/abo-abo/hydra][hydra]]

#+begin_quote
This is a package for GNU Emacs that can be used to tie related commands into a family of
short bindings with a common prefix - a Hydra.
#+end_quote

*** Package

#+BEGIN_SRC emacs-lisp
(use-package hydra
  :bind (("<f2>" . hydra-zoom/body))
  ;;:chords (("ww" . hydra-window/body)
  ;;         ("jz" . hydra-zoom/body))
  :config
  (setq lv-use-separator t)
  (set-face-attribute 'hydra-face-blue nil
                      :foreground "deep sky blue"
                      :weight 'bold))
#+END_SRC

*** text-size -> hydra-zoom

#+BEGIN_SRC emacs-lisp
(defhydra hydra-zoom (:color red
                             :columns nil)
  "zoom"
  ("=" text-scale-increase "in")
  ("-" text-scale-decrease "out")
  ("0" (text-scale-adjust 0) "reset")
  ("q" nil "quit" :color blue))
#+END_SRC

*** window management -> hydra-window

#+BEGIN_SRC emacs-lisp
(defhydra hydra-window (:color red
                               :columns nil)
  "window"
  ("h" windmove-left nil)
  ("j" windmove-down nil)
  ("k" windmove-up nil)
  ("l" windmove-right nil)
  ("2" split-below-and-move "vert")
  ("3" split-right-and-move "horz")
  ("t" transpose-frame "'" :exit t)
  ("a" ace-window "ace")
  ("s" ace-swap-window "swap")
  ("d" ace-delete-window "del")
  ("o" ace-maximize-window "ace-one" :exit t)
  ("b" ivy-switch-buffer "buf")
  ("m" headlong-bookmark-jump "bmk")
  ("q" nil "cancel")
  ("z" aw-switch-buffer-in-window "bufwin")
  ("u" (progn
         (winner-undo)
         (setq this-command 'winner-undo)) "undo"))
#+END_SRC

