init.el

;; [[file:~/.emacs.d/readme.org::*History][History:1]]
(setq-default history-length 1000
              history-delete-duplicates t
              savehist-save-minibuffer-history 1
              savehist-additional-variables '(kill-ring
                                              search-ring
                                              regexp-search-ring))
(savehist-mode t)
;; History:1 ends here

;; [[file:~/.emacs.d/readme.org::*Scrolling][Scrolling:1]]
(setq scroll-margin 0
      scroll-conservatively 100000
      scroll-preserve-screen-position 1
      mouse-wheel-scroll-amount '(1 ((shift) . 1))
      mouse-wheel-progressive-speed nil
      mouse-wheel-follow-mouse 't)
;; Scrolling:1 ends here

;; [[file:~/.emacs.d/readme.org::*Useful%20functions][Useful functions:1]]
(put 'downcase-region 'disabled nil)
(put 'upcase-region 'disabled nil)
(put 'narrow-to-region 'disabled nil)
(put 'narrow-to-page 'disabled nil)
;; Useful functions:1 ends here

;; [[file:~/.emacs.d/readme.org::*Split%20window%20and%20move][Split window and move:1]]
  (defun split-below-and-move ()
    (interactive)
    (split-window-below)
    (other-window 1))

  (defun split-right-and-move ()
    (interactive)
    (split-window-right)
    (other-window 1))

  (bind-keys ("C-x 2" . split-below-and-move)
             ("C-x 3" . split-right-and-move))
;; Split window and move:1 ends here

;; [[file:~/.emacs.d/readme.org::*Kill%20the%20current%20buffer][Kill the current buffer:1]]
(defun my/kill-this-buffer ()
  "Kill the current buffer."
  (interactive)
  (kill-buffer (current-buffer)))

(global-set-key (kbd "C-x k") 'my/kill-this-buffer)
;; Kill the current buffer:1 ends here

;; [[file:~/.emacs.d/readme.org::*Improved%20kill-word][Improved kill-word:1]]
(defun my/kill-word ()
  "Kill the entire word your cursor is in. Equivalent to 'ciw' in vim."
  (interactive)
  (forward-char 1)
  (backward-word)
  (kill-word 1))

(global-set-key (kbd "H-d w") 'my/kill-word)
;; Improved kill-word:1 ends here

;; [[file:~/.emacs.d/readme.org::*Improved%20copy-word][Improved copy-word:1]]
(defun my/copy-word ()
  "Copy the whole word your cursor is in."
  (interactive)
  (save-excursion (forward-char 1)
                  (backward-word)
                  (kill-word 1)
                  (yank)))

(global-set-key (kbd "H-c w") 'my/copy-word)
;; Improved copy-word:1 ends here

;; [[file:~/.emacs.d/readme.org::*Copy%20a%20line][Copy a line:1]]
(defun my/copy-line ()
  "Copies a line regardless the cursor position."
  (interactive)
  (save-excursion (kill-new
                   (buffer-substring
                    (point-at-bol)
                    (point-at-eol)))))

(global-set-key (kbd "H-c l") 'my/copy-line)
;; Copy a line:1 ends here

;; [[file:~/.emacs.d/readme.org::*Org%20header%20IDs][Org header IDs:1]]
  (defun my/copy-id-to-clipboard()
    "Copy the ID property value to killring,
  if no ID is there then create a new unique ID.
  This function works only in org-mode buffers.

  The purpose of this function is to easily construct id:-links to
  org-mode items. If its assigned to a key it saves you marking the
  text and copying to the killring."
         (interactive)
         (when (eq major-mode 'org-mode) ; do this only in org-mode buffers
       (setq mytmpid (funcall 'org-id-get-create))
       (kill-new mytmpid)
       (message "Copied %s to killring (clipboard)" mytmpid)
         ))

  (global-set-key (kbd "<f5>") 'my/copy-id-to-clipboard)
;; Org header IDs:1 ends here

;; [[file:~/.emacs.d/readme.org::*Create%20parent%20directories%20when%20saving%20file][Create parent directories when saving file:1]]
(defun sensible-defaults/offer-to-create-parent-directories-on-save ()
  "When saving a file in a directory that doesn't exist, offer
to (recursively) create the file's parent directories."
  (add-hook 'before-save-hook
            (lambda ()
              (when buffer-file-name
                (let ((dir (file-name-directory buffer-file-name)))
                  (when (and (not (file-exists-p dir))
                             (y-or-n-p (format "Directory %s does not exist. Create it?" dir)))
                    (make-directory dir t)))))))
;; Create parent directories when saving file:1 ends here

;; [[file:~/.emacs.d/readme.org::*general.el][general.el:1]]
  (use-package general
    :config
    (general-define-key
     :prefix "H-SPC"
     ;; applications
     "a" '(:ignore t :which-key "Applications")
     "ad" 'dired-jump
     "am" 'notmuch
     "ag" 'magit-status

     ;; buffers
     "b" '(:ignore t :which-key "Buffers")
     "bb" 'switch-to-buffer
     "bd" 'kill-this-buffer
     "by" 'copy-whole-buffer

     ;; ;; files
     "f" '(:ignore t :which-key "Files")
     "ff" 'find-file
     "fl" 'load-file
     "fs" 'save-buffer

  ;; edit text
     "e" '(:ignore t :which-key "Edit")
     "em" 'hydra-mc/body

     ;; ;; spelling
     "s" '(:ignore t :which-key "Spelling")
     "sb" 'flyspell-buffer
     "sd" 'switch-dictionary
     "sn" 'flyspell-goto-next-error
     "sp" 'flyspell-popup-correct
     "sw" 'flyspell-auto-correct-word
     "sz" 'flyspell-lazy-check-buffer

     ;; modes
     "m" '(:ignore t :which-key "Modes")
     "ml" 'global-display-line-numbers-mode
     "mw" 'whitespace-mode)

    (general-define-key
     :keymaps 'dired-mode-map
     :prefix ","
     "&" 'dired-do-async-shell-command
     "s" 'dired-get-size
     "_" 'xah-dired-rename-space-to-underscore
     "-" 'xah-dired-rename-space-to-hyphen))
;; general.el:1 ends here

;; [[file:~/.emacs.d/readme.org::*Package][Package:1]]
(use-package hydra
  :bind (("<f2>" . hydra-zoom/body))
  ;;:chords (("ww" . hydra-window/body)
  ;;         ("jz" . hydra-zoom/body))
  :config
  (setq lv-use-separator t)
  (set-face-attribute 'hydra-face-blue nil
                      :foreground "deep sky blue"
                      :weight 'bold))
;; Package:1 ends here

;; [[file:~/.emacs.d/readme.org::*text-size%20->%20hydra-zoom][text-size -> hydra-zoom:1]]
(defhydra hydra-zoom (:color red
                             :columns nil)
  "zoom"
  ("=" text-scale-increase "in")
  ("-" text-scale-decrease "out")
  ("0" (text-scale-adjust 0) "reset")
  ("q" nil "quit" :color blue))
;; text-size -> hydra-zoom:1 ends here

;; [[file:~/.emacs.d/readme.org::*window%20management%20->%20hydra-window][window management -> hydra-window:1]]
(defhydra hydra-window (:color red
                               :columns nil)
  "window"
  ("h" windmove-left nil)
  ("j" windmove-down nil)
  ("k" windmove-up nil)
  ("l" windmove-right nil)
  ("2" split-below-and-move "vert")
  ("3" split-right-and-move "horz")
  ("t" transpose-frame "'" :exit t)
  ("a" ace-window "ace")
  ("s" ace-swap-window "swap")
  ("d" ace-delete-window "del")
  ("o" ace-maximize-window "ace-one" :exit t)
  ("b" ivy-switch-buffer "buf")
  ("m" headlong-bookmark-jump "bmk")
  ("q" nil "cancel")
  ("z" aw-switch-buffer-in-window "bufwin")
  ("u" (progn
         (winner-undo)
         (setq this-command 'winner-undo)) "undo"))
;; window management -> hydra-window:1 ends here
