init.el

;; [[file:~/.emacs.d/readme.org::*hydra-git][hydra-git:1]]
;; create a hydra for git and bind it to SPC g
(defhydra hydra-git (:color red
                            :columns nil)
  "A hydra for git!"
  ("g" magit-status "magit" :color blue)
  ("j" git-gutter:next-hunk "next")
  ("k" git-gutter:previous-hunk "previous")
  ("d" git-gutter:popup-hunk "diff")
  ("s" git-gutter:stage-hunk "stage")
  ("r" git-gutter:revert-hunk "revert")
  ("m" git-gutter:mark-hunk "mark")
  ("q" nil "cancel" :color blue))
;; hydra-git:1 ends here

;; [[file:~/.emacs.d/readme.org::*%5B%5Bhttps://github.com/justbur/emacs-which-key%5D%5Bwhich-key%5D%5D][[[https://github.com/justbur/emacs-which-key][which-key]]:1]]
(use-package which-key
  :init
  (which-key-mode)
  :config
  (validate-setq which-key-idle-delay 0.5
                 which-key-compute-remaps t ; show correct descriptions for remapped keys
                 which-key-allow-multiple-replacements t)

  (validate-setq which-key-replacement-alist
                 ;; Replacements for how part or whole of FUNCTION is replaced when which-key
                 ;; displays
                 ;; KEY → FUNCTION
                 '(((nil . "Prefix Command") . (nil . "prefix"))
                   ((nil . "which-key-show-next-page") . (nil . "next pg"))
                   ((nil . "/body\\'") . (nil . "")) ; Remove display the "/body" portion of hydra fn names
                   ((nil . "\\`hydra-") . (nil . "+h/"))
                   ((nil . "\\`org-babel-") . (nil . "ob/"))
                   ((nil . "\\`artist-select-op-") . (nil . "")) ; Make artist-mode function names less verbose
                   ((nil . "\\`artist-select-") . (nil . "sel-"))
                   ((nil . "\\`artist-toggle-") . (nil . "toggle-"))
                   ((nil . "\\`engine/search-") . (nil . "🔎 "))

                   ;; Replacements for how KEY is replaced when which-key displays
                   ;;   KEY → FUNCTION
                   ;; Eg: After "C-c", display "right → winner-redo" as "▶ → winner-redo"
                   (("<left>"    . nil) . ("◀" . nil)) ; ←
                   (("<right>"   . nil) . ("▶" . nil)) ; →
                   (("<up>"      . nil) . ("▲" . nil)) ; ↑
                   (("<down>"    . nil) . ("▼" . nil)) ; ↓
                   (("\\`DEL\\'" . nil) . ("⌫" . nil)) ; backspace key
                   (("<next>"    . nil) . ("PgDn" . nil))
                   (("<prior>"   . nil) . ("PgUp" . nil))
                   (("RET"       . nil) . ("⏎" . nil))
                   (("deletechar" . nil) . ("⌦" . nil))))

  ;; Change what string to display for a given *complete* key binding
  ;; Eg: After "C-x", display "8 → +unicode" instead of "8 → +prefix"
  (which-key-add-key-based-replacements
    "C-x 8"   "unicode"
    "C-x a"   "abbrev/expand"
    "C-x r"   "rectangle/register/bookmark"
    "C-x v"   "VC"
    "C-c /" "engine-mode-map"
    "C-c C-v" "org-babel"))
;; [[https://github.com/justbur/emacs-which-key][which-key]]:1 ends here

;; [[file:~/.emacs.d/readme.org::*Defaults][Defaults:1]]
(use-package org
  :general  (("C-c a" 'org-agenda-list)
             ("C-c c" 'org-capture)
             ("C-c l" 'org-store-link)
             ;;("C-c f" . org-cycle-agenda-files)
             ;;("C-c s" . org-search-view)
             ("C-c t" 'org-todo-list)
             ("s-j"   'org-babel-next-src-block)
             ("s-k"   'org-babel-previous-src-block)
             ("s-l"   'org-edit-src-code)
             (org-src-mode-map
             "s-l" 'org-edit-src-exit)
             (org-mode-map
              "c" 'org-capture
              "d" 'org-clock-display
              "i" 'org-clock-in
              "o" 'org-clock-out))
  :config
  (validate-setq
   ;;org-tags-column 90                  ; column to which the tags have to be indented
   org-ellipsis "  "                   ; ⬎, ⤷, ⤵, ⚡,  
   org-fontify-whole-heading-line t     ; fontify the whole line for headings
   org-fontify-done-headline t
   org-fontify-quote-and-verse-blocks t
   org-startup-indented t
   org-cycle-include-plain-lists t
   org-list-allow-alphabetical t
   org-preview-latex-default-process 'imagemagick ; preview latex fragments

   ;; Code blocks to play nicelly on org-babel
   org-edit-src-content-indentation 0 ; number of whitespaces added to the code block indentation
   org-src-tab-acts-natively t    ; TAB acts natively as it was in the language major mode
   org-src-preserve-indentation t ; preserve indentation when exporting blocks
   org-src-fontify-natively t     ; highlights code-blocks natively
   org-src-window-setup 'current-window ; open code-blocks in the current window
   org-confirm-babel-evaluate nil  ; don't ask for confirmation when compiling code-blocks

   ;; Files location
   ;;org-directory "~/org"
   org-default-notes-file "notes.org"
   org-agenda-files (list "~/org/todo.org"
                          "~/org/clockin.org"))

  ;; Refile
  ;; https://blog.aaronbieber.com/2017/03/19/organizing-notes-with-refile.html
  (setq org-refile-targets '(("www.org" :maxlevel . 2)))
  (setq org-refile-use-outline-path t)          ; Show full paths for refiling
  (setq org-outline-path-complete-in-steps nil) ; Refile in a single go
  (setq org-refile-allow-creating-parent-nodes 'confirm)

  ;; enter “<el” and hit tab creates a template for elisp insertion
  (add-to-list 'org-structure-template-alist
               '("el" . "src emacs-lisp"))

  ;; TODO workflow states
  org-todo-keywords
  '("☛ TODO(t)" "⚑ WAIT(w@)" "|" "✔ DONE(d)" "✘ CANCEL(c@)")

  ;; TODO fontification
  org-todo-keyword-faces
  '(("☛ TODO"   . (:foreground "#ff4500" :weight bold))
    ("✔ DONE"   . (:foreground "#00ff7f" :weight bold))
    ("⚑ WAIT"   . (:foreground "#ffff00" :weight bold))
    ("✘ CANCEL" . (:foreground "#00bfff" :weight bold)))
  )
;; Defaults:1 ends here

;; [[file:~/.emacs.d/readme.org::*org-babel][org-babel:1]]
(use-package ob
  :ensure nil
  :config
  (org-babel-do-load-languages
   (quote org-babel-load-languages)
   (quote ((calc . t)
           (clojure . t)
           (ditaa . t)
           (dot . t)
           (emacs-lisp . t)
           (gnuplot . t)
           (latex . t)
           (ledger . t)
           (octave . t)
           (org . t)
           (makefile . t)
           (plantuml . t)
           (python . t)
           (R . t)
           (ruby . t)
           (shell . t)
           (sqlite . t)
           (sql . t)
           ))))
;; org-babel:1 ends here

;; [[file:~/.emacs.d/readme.org::*org-clock][org-clock:1]]
(use-package org-clock
  :ensure nil
  :config
  (org-clock-persistence-insinuate)           ; resume clocking task when emacs is restarted
  (validate-setq
   org-clock-persist t                        ; save all clock history when exiting Emacs, load it on startup
   org-clock-persist-query-resume nil         ; do not prompt to resume an active clock
   org-clock-history-length 10                ; show lot of clocking history from where choose items
   org-clock-in-resume t                      ; resume clocking task on clock-in if the clock is open
   org-clock-clocked-in-display nil           ; don't show current task in the modeline
   org-clock-into-drawer "CLOCKING"           ; clocking goes into specfic drawer
   org-clock-report-include-clocking-task t)) ; include current clocking task in clock reports
;; org-clock:1 ends here
