readme.org
*** counsel-org-clock

#+BEGIN_QUOTE
[[https://github.com/akirak/counsel-org-clock][counsel-org-clock]] provides commands for displaying org clock entries via [[https://github.com/abo-abo/swiper][Counsel (Ivy)]]
interface.
#+END_QUOTE

Other actions can be selected through =M-o=.

#+begin_src emacs-lisp :tangle no
(use-package counsel-org-clock
  :straight (counsel-org-clock :type git
                               :host github
                               :repo "akirak/counsel-org-clock"))
#+end_src

*** org-capture-templates

The ~Protocol Quote (p)~ and ~Protocol Link (L)~ templates work through the use of the [[http://orgmode.org/worg/org-contrib/org-protocol.html][org
protocol]] handler [[https://github.com/sprig/org-capture-extension][found here]], which is a Chrome/Firefox addon.

Specifically, the ~Protocol Quote~ is activated when a text is selected in the site,
capturing the text selected (quote). The ~Protocol Link~ works when no text is selected,
capturing only the site address.

Here is a list of the special %-escapes or placeholders used on [[http://orgmode.org/manual/Template-expansion.html#Template-expansion][org templates]].

#+BEGIN_SRC emacs-lisp
(use-package org-capture
  :ensure nil
  :config
  (setq org-capture-templates
        '(("p" "Protocol Quote" entry
           (file+headline "www.org" "Bookmarks")
           "* %?[[%:link][%:description]]\n:PROPERTIES:\n:CREATED: %U\n:END:\n\n#+BEGIN_QUOTE\n%i\n#+END_QUOTE\n"
           :empty-lines 1
           :immediate-finish
           )

          ("L" "Protocol Link" entry
           (file+headline "www.org" "Bookmarks")
           "* %?[[%:link][%:description]]\n:PROPERTIES:\n:CREATED: %U\n:END:\n"
           :empty-lines 1
           :immediate-finish
           )

          ("t" "Tasks" entry
           (file+headline "tasks.org" "Tasks")
           "* ☛ TODO %^{Task} %^g\n:PROPERTIES:\n:CREATED: %U\n:END:\n%?%i"
           :empty-lines 1)

          ("n" "Notes" entry
           (file+headline "notes.org" "Notes")
           "* %^{Header} %^G\n %u\n %?")

          ("j" "Journal" entry
           (file+datetree "journal.org")
           "* %U %^{Title}\n %?%i\n %a")

          ("a" "Articles" entry
           (file+headline "articles.org" "Articles")
           "* %^{Title} %^g\n:PROPERTIES:\n:CREATED: %U\n:END:\n%?%i\n"
           :empty-lines 1
           :immediate-finish)
          )))
#+END_SRC

*** org-bullets

#+BEGIN_SRC emacs-lisp
(use-package org-bullets
  :hook (org-mode . (lambda () (org-bullets-mode t)))
  :config
  ;;(setq org-bullets-bullet-list '("☯" "☰" "☱" "☲" "☳" "☴" "☵" "☶" "☷"))
  ;;(setq org-bullets-bullet-list '("♣" "♥" "♠" "♦" "♧" "♡" "♤" "♢"))
  ;;(validate-setq org-bullets-bullet-list '("☯" "☉" "∞" "◉" "⊚" "☀" "☾" "☥"))
  (validate-setq org-bullets-bullet-list '("◉" "☉" "⊚" "○" "∞"))

  ;; make available "org-bullet-face" such that I can control the font size individually
  (validate-setq org-bullets-face-name (quote org-bullet-face))
  ;; (custom-set-faces '(org-bullet-face
  ;;                     ((t (:foreground "burlywood"
  ;;                                      :weight normal
  ;;                                      :height 1.6)))))
  )
#+END_SRC

*** ox.el

#+BEGIN_SRC emacs-lisp
(use-package ox
  :ensure nil
  :config
  (validate-setq org-export-with-smart-quotes t
                 org-export-allow-bind-keywords t
                 org-latex-listings 'minted
                 org-latex-packages-alist '(("" "color" t)
                                            ("" "minted" t)
                                            ("" "parskip" t)
                                            ("" "tikz" t)))

  (when (system-is-mac)
    (validate-setq org-ditaa-jar-path "/usr/local/bin/ditaa"))

  (setq org-latex-pdf-process
        '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
  )
#+END_SRC

*** ox-pandoc

I’m using ox-pandoc to export org files to all formats Pandoc works with. It
only exports org files, in opposite of pandoc-mode, which exports from any
source format. The problem is that ox-pandoc needs considerably less
configuration and as I usually write everything in org-mode, no need to worry.
https://github.com/kawabata/ox-pandoc
http://www.rousette.org.uk/blog/archives/org-mode-and-pandoc/ Keeping a lab book
with org-mode http://informatica.boccaperta.com/m-x-emacs-ox-pandoc/

#+BEGIN_SRC emacs-lisp
(use-package ox-pandoc
  ;;  :after org-plus-contrib
  :config
  (validate-setq org-pandoc-options '((standalone . t)
                                      (mathjax . t)
                                      (highlight-style . "pygments"))
                 org-pandoc-options-for-docx '((standalone . nil))
                 org-pandoc-options-for-beamer-pdf '((pdf-engine . "lualatex"))
                 org-pandoc-options-for-latex-pdf  '((pdf-engine . "lualatex"))
                 ;;org-pandoc-options-for-latex-pdf '((latex-engine . "xelatex")
                 ;;                                   (template . "~/.pandoc/templates/memoir2.latex" ))

                 ;; Use external css for html5
                 ;; (let ((stylesheet (expand-file-name
                 ;;                    (locate-user-emacs-file "etc/pandoc.css"))))
                 ;;   (setq org-pandoc-options-for-html5
                 ;;         `((css . ,(concat "file://" stylesheet)))))
                 ))
#+END_SRC

*** [[https://github.com/snosov1/toc-org][toc-org]]

#+begin_quote
toc-org is an Emacs utility to have an up-to-date table of contents in the org files
without exporting (useful primarily for readme files on GitHub)
#+end_quote

#+begin_src emacs-lisp
(use-package toc-org
  :hook (org-mode . toc-org-enable))
#+end_src

*** org-brain

#+begin_src emacs-lisp
(use-package org-brain
  :config
  (push '("b" "Brain" plain (function org-brain-goto-end)
          "* %i%?" :empty-lines 1)
        org-capture-templates)
  (setq org-brain-visualize-default-choices 'all)
  (setq org-brain-title-max-length 12))
#+end_src

** [[https://github.com/abo-abo/swiper][ivy]]
