init.el

;; [[file:~/.emacs.d/readme.org::*org-capture-templates][org-capture-templates:1]]
(use-package org-capture
  :ensure nil
  :config
  (setq org-capture-templates
        '(("p" "Protocol Quote" entry
           (file+headline "www.org" "Bookmarks")
           "* %?[[%:link][%:description]]\n:PROPERTIES:\n:CREATED: %U\n:END:\n\n#+BEGIN_QUOTE\n%i\n#+END_QUOTE\n"
           :empty-lines 1
           :immediate-finish
           )

          ("L" "Protocol Link" entry
           (file+headline "www.org" "Bookmarks")
           "* %?[[%:link][%:description]]\n:PROPERTIES:\n:CREATED: %U\n:END:\n"
           :empty-lines 1
           :immediate-finish
           )

          ("t" "Tasks" entry
           (file+headline "tasks.org" "Tasks")
           "* ☛ TODO %^{Task} %^g\n:PROPERTIES:\n:CREATED: %U\n:END:\n%?%i"
           :empty-lines 1)

          ("n" "Notes" entry
           (file+headline "notes.org" "Notes")
           "* %^{Header} %^G\n %u\n %?")

          ("j" "Journal" entry
           (file+datetree "journal.org")
           "* %U %^{Title}\n %?%i\n %a")

          ("a" "Articles" entry
           (file+headline "articles.org" "Articles")
           "* %^{Title} %^g\n:PROPERTIES:\n:CREATED: %U\n:END:\n%?%i\n"
           :empty-lines 1
           :immediate-finish)
          )))
;; org-capture-templates:1 ends here

;; [[file:~/.emacs.d/readme.org::*org-bullets][org-bullets:1]]
(use-package org-bullets
  :hook (org-mode . (lambda () (org-bullets-mode t)))
  :config
  ;;(setq org-bullets-bullet-list '("☯" "☰" "☱" "☲" "☳" "☴" "☵" "☶" "☷"))
  ;;(setq org-bullets-bullet-list '("♣" "♥" "♠" "♦" "♧" "♡" "♤" "♢"))
  ;;(validate-setq org-bullets-bullet-list '("☯" "☉" "∞" "◉" "⊚" "☀" "☾" "☥"))
  (validate-setq org-bullets-bullet-list '("◉" "☉" "⊚" "○" "∞"))

  ;; make available "org-bullet-face" such that I can control the font size individually
  (validate-setq org-bullets-face-name (quote org-bullet-face))
  ;; (custom-set-faces '(org-bullet-face
  ;;                     ((t (:foreground "burlywood"
  ;;                                      :weight normal
  ;;                                      :height 1.6)))))
  )
;; org-bullets:1 ends here

;; [[file:~/.emacs.d/readme.org::*ox.el][ox.el:1]]
(use-package ox
  :ensure nil
  :config
  (validate-setq org-export-with-smart-quotes t
                 org-export-allow-bind-keywords t
                 org-latex-listings 'minted
                 org-latex-packages-alist '(("" "color" t)
                                            ("" "minted" t)
                                            ("" "parskip" t)
                                            ("" "tikz" t)))

  (when (system-is-mac)
    (validate-setq org-ditaa-jar-path "/usr/local/bin/ditaa"))

  (setq org-latex-pdf-process
        '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
  )
;; ox.el:1 ends here

;; [[file:~/.emacs.d/readme.org::*ox-pandoc][ox-pandoc:1]]
(use-package ox-pandoc
  ;;  :after org-plus-contrib
  :config
  (validate-setq org-pandoc-options '((standalone . t)
                                      (mathjax . t)
                                      (highlight-style . "pygments"))
                 org-pandoc-options-for-docx '((standalone . nil))
                 org-pandoc-options-for-beamer-pdf '((pdf-engine . "lualatex"))
                 org-pandoc-options-for-latex-pdf  '((pdf-engine . "lualatex"))
                 ;;org-pandoc-options-for-latex-pdf '((latex-engine . "xelatex")
                 ;;                                   (template . "~/.pandoc/templates/memoir2.latex" ))

                 ;; Use external css for html5
                 ;; (let ((stylesheet (expand-file-name
                 ;;                    (locate-user-emacs-file "etc/pandoc.css"))))
                 ;;   (setq org-pandoc-options-for-html5
                 ;;         `((css . ,(concat "file://" stylesheet)))))
                 ))
;; ox-pandoc:1 ends here

;; [[file:~/.emacs.d/readme.org::*%5B%5Bhttps://github.com/snosov1/toc-org%5D%5Btoc-org%5D%5D][[[https://github.com/snosov1/toc-org][toc-org]]:1]]
(use-package toc-org
  :hook (org-mode . toc-org-enable))
;; [[https://github.com/snosov1/toc-org][toc-org]]:1 ends here

;; [[file:~/.emacs.d/readme.org::*org-brain][org-brain:1]]
(use-package org-brain
  :config
  (push '("b" "Brain" plain (function org-brain-goto-end)
          "* %i%?" :empty-lines 1)
        org-capture-templates)
  (setq org-brain-visualize-default-choices 'all)
  (setq org-brain-title-max-length 12))
;; org-brain:1 ends here

;; [[file:~/.emacs.d/readme.org::*ivy][ivy:1]]
(use-package ivy
