readme.org
*** ivy

Ivy is a generic completion frontend for Emacs.

#+BEGIN_SRC emacs-lisp
(use-package ivy
  :bind (("C-c C-r"  . ivy-resume)
         :map ivy-minibuffer-map
         ("<return>" . ivy-alt-done)
         ("C-M-h"    . ivy-previous-line-and-call)
         ("C-:"      . ivy-dired)
         ("C-c o"    . ivy-occur)
         ("C-j"      . ivy-next-line)
         ("C-k"      . ivy-previous-line)
         ("C-l"      . ivy-alt-done)
         :map read-expression-map
         ("C-r"      . counsel-expression-history))
  :chords (("bb" . ivy-switch-buffer))
  :config
  (ivy-mode 1)
  (validate-setq ivy-use-virtual-buffers t         ; list `recentf' and bookmarks as well
                 ivy-height 15
                 ivy-count-format "(%d/%d) "       ; counter
                 ivy-extra-directories nil         ; Do not show "./" and "../"
                 ivy-virtual-abbreviate 'full      ; Show full file path
                 ivy-re-builders-alist '((t . ivy--regex-ignore-order))
                 ivy-use-ignore-default 'always    ; ignore buffers set in `ivy-ignore-buffers'
                 ivy-ignore-buffers                ; ignore some buffers in `ivy-switch-buffer'
                 '("company-statistics-cache.el" ".elfeed/index"))

  (defun ivy-dired ()
    (interactive)
    (if ivy--directory
        (ivy-quit-and-run
         (dired ivy--directory)
         (when (re-search-forward
                (regexp-quote
                 (substring ivy--current 0 -1)) nil t)
           (goto-char (match-beginning 0))))
      (user-error
       "Not completing files currently")))

  ;; Customize faces per mode
  ;;(validate-setq ivy-switch-buffer-faces-alist
  ;;               '((emacs-lisp-mode . swiper-match-face-1)
  ;;                 (dired-mode . ivy-subdir)
  ;;                 (org-mode . org-level-4)))
  )

;; Speed up my workflow with prearranged windows
;; (setq ivy-views '(("boccaperta + ba-server [–]"
;;                    (vert
;;                     (sexp (bookmark-jump "boccaperta"))
;;                     (sexp (bookmark-jump "ba-server"))))
;;                   ("desktop + ba-server [–]"
;;                    (vert
;;                     (sexp (bookmark-jump "desktop"))
;;                     (sexp (bookmark-jump "ba-server"))))))

;; Hydra bindings for ivy buffer
(use-package ivy-hydra
  :after ivy)

(use-package all-the-icons-ivy
  :after all-the-icons
  :config
  (all-the-icons-ivy-setup))

;; smex order selections accordingly to the most used ones
(use-package smex)
#+END_SRC

*** counsel

Counsel takes ivy further, providing versions of common Emacs commands that are
customized to make the best use of ivy.

#+BEGIN_SRC emacs-lisp
(use-package counsel
  :bind (("C-h l"   . counsel-load-library)
         ;;("<f2> u"  . counsel-unicode-char)
         ("C-r"     . counsel-grep-or-swiper)
         ("C-c g"   . counsel-git)
         ("C-c j"   . counsel-git-grep)
         ("C-c k"   . counsel-rg)
         ("C-x l"   . counsel-locate)
         ("C-c r"   . counsel-linux-app)
         ("C-x i"   . counsel-imenu))
  :config
  (counsel-mode 1)
  (validate-setq  counsel-mode-override-describe-bindings t
                  counsel-find-file-at-point t
                  counsel-find-file-ignore-regexp
                  (concat
                   "\\(?:\\`[#.]\\)"              ; file names beginning with # or .
                   "\\|\\(?:\\`.+?[#~]\\'\\)"     ; file names ending with # or ~
                   )))

(use-package counsel-projectile
  :after projectile
  :config
  (counsel-projectile-mode))
#+END_SRC

*** swiper

[[https://github.com/abo-abo/swiper][Swiper]] shows an overview during regex searching. It uses the /ivy/ back-end for
the overview.

#+begin_src emacs-lisp
(use-package swiper
  :bind (("C-s" . swiper))
  :config
  ;; always recenter when leaving swiper
  (validate-setq swiper-action-recenter t))
#+end_src

** projectile

It's a project interaction library for Emacs. Its goal is to provide a nice set of
features operating on a project level without introducing external dependencies (when
feasible). For instance - finding project files has a portable implementation written in
pure Emacs Lisp without the use of GNU find (but for performance sake an indexing
mechanism backed by external commands exists as well).

#+BEGIN_SRC emacs-lisp
(use-package projectile
  :config
  (setq projectile-enable-caching t
        projectile-completion-system 'ivy
        projectile-switch-project-action 'projectile-dired
        projectile-mode-line '(:eval (format
                                      " :%s:" (projectile-project-name))))
  (projectile-mode))

(use-package ibuffer-projectile)
#+END_SRC

* Base packages
** alert

A [[https://github.com/jwiegley/alert][Growl-like alerts]] notifier for Emacs. It accepts rules for alerting about almost
anything.

TODO: add rule for email receiving monitoring alerts (Icinga and alikes)

#+BEGIN_SRC emacs-lisp
(use-package alert)
#+END_SRC

** anzu
anzu provides a minor mode which displays current match and total matches
information in the mode-line in various search modes.

#+BEGIN_SRC emacs-lisp
(use-package anzu
  :bind (("M-%" . anzu-query-replace)
         ("C-M-%" . anzu-query-replace-regexp))
  :config
  (validate-setq anzu-cons-mode-line-p nil
                 anzu-replace-to-string-separator "  ")
  (global-anzu-mode +1))
#+END_SRC

** async

Simple library for asynchronous processing in Emacs

#+BEGIN_SRC emacs-lisp
(use-package async
  :config
  (async-bytecomp-package-mode t))
#+END_SRC

** bookmarks
Bookmarks to files and directories

#+BEGIN_SRC emacs-lisp
(use-package bookmark
  :config
  (setq bookmark-completion-ignore-case nil)
  (bookmark-maybe-load-default-file))
#+END_SRC

** easy-kill

[[https://github.com/leoliu/easy-kill][Provide commands]] ~easy-kill~ and ~easy-mark~ to let users kill or mark things easily.

The keybinding is =M-w= to start To show all key shortcuts, call for help with =?=.

#+BEGIN_SRC emacs-lisp
(use-package easy-kill
  :bind (([remap kill-ring-save] . easy-kill)
         ([remap mark-sexp] . easy-mark)))
#+END_SRC

** ediff

The default ~ediff-mode~ isn't quite optimized. The following settings are taken
from [[http://oremacs.com/2015/01/17/setting-up-ediff/][Oremacs]].

Just a note about the ~--text~ in the ~ediff-diff-options~: it will force the
GNU utility ~diff~, which is called by ~ediff~, to treat the input files as text
files. This is necessary as the utility ~diff~ doesn't understand unicode, and
sees unicode encoded files as binary files ([[http://stackoverflow.com/questions/10503937/emacs-ediff-foreign-character-sets-and-text-file-encodings][stackoverflow]]).

#+BEGIN_SRC emacs-lisp
(use-package ediff
  :hook ((ediff-before-setup . my-store-pre-ediff-winconfig)
         (ediff-quit . my-restore-pre-ediff-winconfig))
  :config
  (customize-set-variable 'ediff-window-setup-function 'ediff-setup-windows-plain)
  (customize-set-variable 'ediff-split-window-function 'split-window-horizontally)
  (customize-set-variable 'ediff-highlight-all-diffs 'nil) ; only highlight current diff
  (customize-set-variable 'ediff-diff-options "-w --text")

  ;; restore windows and layout after ending ediff session
  ;; https://emacs.stackexchange.com/questions/7482/restoring-windows-and-layout-after-an-ediff-session
  (defvar my-ediff-last-windows nil)

  (defun my-store-pre-ediff-winconfig ()
    (setq my-ediff-last-windows (current-window-configuration)))

  (defun my-restore-pre-ediff-winconfig ()
    (set-window-configuration my-ediff-last-windows)))
#+END_SRC

** esup

#+BEGIN_SRC emacs-lisp
(use-package esup
  :config
  (setq esup-insignificant-time 0.001))
#+END_SRC

** fill-column-indicator

Toggle the vertical column that indicates the fill threshold.

#+BEGIN_SRC emacs-lisp
(use-package fill-column-indicator
  :disabled t
  :config
  (validate-setq fci-rule-width 1
                 fci-rule-color "#5d478b"
                 fci-rule-column 80)
  (define-globalized-minor-mode global-fci-mode fci-mode
    (lambda ()
      (fci-mode 1)))
  (global-fci-mode 1))
#+END_SRC

** fixmee

Fixmee-mode tracks fixme notices in code comments, highlights them, ranks them
by urgency, and lets you navigate to them quickly.

It requires [[https://github.com/rolandwalker/button-lock][button-lock.el]], which is installed by ~wiki-nav~.

*Patterns* - The following fixme patterns are supported by default:

@@@
XXX         ; only this one is case-sensitive
todo
fixme

*Key bindings*

| Keystrokes | 	Function                                             |
|------------+----------------------------------------------------------|
| C-c f      | fixmee-goto-nextmost-urgent                              |
| C-c F      | fixmee-goto-prevmost-urgent                              |
| C-c v      | fixmee-view-listing                                      |
| M-n        | fixmee-goto-next-by-position ; only when the point is    |
| M-p        | fixmee-goto-previous-by-position ; inside a fixme notice |

#+BEGIN_SRC emacs-lisp
(use-package wiki-nav
  :config
  (global-wiki-nav-mode 1))

(use-package fixmee
  :after wiki-nav
  :config
  (global-fixmee-mode 1))
#+END_SRC

