init.el
  :bind (("C-c C-r"  . ivy-resume)
         :map ivy-minibuffer-map
         ("<return>" . ivy-alt-done)
         ("C-M-h"    . ivy-previous-line-and-call)
         ("C-:"      . ivy-dired)
         ("C-c o"    . ivy-occur)
         ("C-j"      . ivy-next-line)
         ("C-k"      . ivy-previous-line)
         ("C-l"      . ivy-alt-done)
         :map read-expression-map
         ("C-r"      . counsel-expression-history))
  :chords (("bb" . ivy-switch-buffer))
  :config
  (ivy-mode 1)
  (validate-setq ivy-use-virtual-buffers t         ; list `recentf' and bookmarks as well
                 ivy-height 15
                 ivy-count-format "(%d/%d) "       ; counter
                 ivy-extra-directories nil         ; Do not show "./" and "../"
                 ivy-virtual-abbreviate 'full      ; Show full file path
                 ivy-re-builders-alist '((t . ivy--regex-ignore-order))
                 ivy-use-ignore-default 'always    ; ignore buffers set in `ivy-ignore-buffers'
                 ivy-ignore-buffers                ; ignore some buffers in `ivy-switch-buffer'
                 '("company-statistics-cache.el" ".elfeed/index"))

  (defun ivy-dired ()
    (interactive)
    (if ivy--directory
        (ivy-quit-and-run
         (dired ivy--directory)
         (when (re-search-forward
                (regexp-quote
                 (substring ivy--current 0 -1)) nil t)
           (goto-char (match-beginning 0))))
      (user-error
       "Not completing files currently")))

  ;; Customize faces per mode
  ;;(validate-setq ivy-switch-buffer-faces-alist
  ;;               '((emacs-lisp-mode . swiper-match-face-1)
  ;;                 (dired-mode . ivy-subdir)
  ;;                 (org-mode . org-level-4)))
  )

;; Speed up my workflow with prearranged windows
;; (setq ivy-views '(("boccaperta + ba-server [–]"
;;                    (vert
;;                     (sexp (bookmark-jump "boccaperta"))
;;                     (sexp (bookmark-jump "ba-server"))))
;;                   ("desktop + ba-server [–]"
;;                    (vert
;;                     (sexp (bookmark-jump "desktop"))
;;                     (sexp (bookmark-jump "ba-server"))))))

;; Hydra bindings for ivy buffer
(use-package ivy-hydra
  :after ivy)

(use-package all-the-icons-ivy
  :after all-the-icons
  :config
  (all-the-icons-ivy-setup))

;; smex order selections accordingly to the most used ones
(use-package smex)
;; ivy:1 ends here

;; [[file:~/.emacs.d/readme.org::*counsel][counsel:1]]
(use-package counsel
  :bind (("C-h l"   . counsel-load-library)
         ;;("<f2> u"  . counsel-unicode-char)
         ("C-r"     . counsel-grep-or-swiper)
         ("C-c g"   . counsel-git)
         ("C-c j"   . counsel-git-grep)
         ("C-c k"   . counsel-rg)
         ("C-x l"   . counsel-locate)
         ("C-c r"   . counsel-linux-app)
         ("C-x i"   . counsel-imenu))
  :config
  (counsel-mode 1)
  (validate-setq  counsel-mode-override-describe-bindings t
                  counsel-find-file-at-point t
                  counsel-find-file-ignore-regexp
                  (concat
                   "\\(?:\\`[#.]\\)"              ; file names beginning with # or .
                   "\\|\\(?:\\`.+?[#~]\\'\\)"     ; file names ending with # or ~
                   )))

(use-package counsel-projectile
  :after projectile
  :config
  (counsel-projectile-mode))
;; counsel:1 ends here

;; [[file:~/.emacs.d/readme.org::*swiper][swiper:1]]
(use-package swiper
  :bind (("C-s" . swiper))
  :config
  ;; always recenter when leaving swiper
  (validate-setq swiper-action-recenter t))
;; swiper:1 ends here

;; [[file:~/.emacs.d/readme.org::*projectile][projectile:1]]
(use-package projectile
  :config
  (setq projectile-enable-caching t
        projectile-completion-system 'ivy
        projectile-switch-project-action 'projectile-dired
        projectile-mode-line '(:eval (format
                                      " :%s:" (projectile-project-name))))
  (projectile-mode))

(use-package ibuffer-projectile)
;; projectile:1 ends here

;; [[file:~/.emacs.d/readme.org::*alert][alert:1]]
(use-package alert)
;; alert:1 ends here

;; [[file:~/.emacs.d/readme.org::*anzu][anzu:1]]
(use-package anzu
  :bind (("M-%" . anzu-query-replace)
         ("C-M-%" . anzu-query-replace-regexp))
  :config
  (validate-setq anzu-cons-mode-line-p nil
                 anzu-replace-to-string-separator "  ")
  (global-anzu-mode +1))
;; anzu:1 ends here

;; [[file:~/.emacs.d/readme.org::*async][async:1]]
(use-package async
  :config
  (async-bytecomp-package-mode t))
;; async:1 ends here

;; [[file:~/.emacs.d/readme.org::*bookmarks][bookmarks:1]]
(use-package bookmark
  :config
  (setq bookmark-completion-ignore-case nil)
  (bookmark-maybe-load-default-file))
;; bookmarks:1 ends here

;; [[file:~/.emacs.d/readme.org::*easy-kill][easy-kill:1]]
(use-package easy-kill
  :bind (([remap kill-ring-save] . easy-kill)
         ([remap mark-sexp] . easy-mark)))
;; easy-kill:1 ends here

;; [[file:~/.emacs.d/readme.org::*ediff][ediff:1]]
(use-package ediff
  :hook ((ediff-before-setup . my-store-pre-ediff-winconfig)
         (ediff-quit . my-restore-pre-ediff-winconfig))
  :config
  (customize-set-variable 'ediff-window-setup-function 'ediff-setup-windows-plain)
  (customize-set-variable 'ediff-split-window-function 'split-window-horizontally)
  (customize-set-variable 'ediff-highlight-all-diffs 'nil) ; only highlight current diff
  (customize-set-variable 'ediff-diff-options "-w --text")

  ;; restore windows and layout after ending ediff session
  ;; https://emacs.stackexchange.com/questions/7482/restoring-windows-and-layout-after-an-ediff-session
  (defvar my-ediff-last-windows nil)

  (defun my-store-pre-ediff-winconfig ()
    (setq my-ediff-last-windows (current-window-configuration)))

  (defun my-restore-pre-ediff-winconfig ()
    (set-window-configuration my-ediff-last-windows)))
;; ediff:1 ends here

;; [[file:~/.emacs.d/readme.org::*esup][esup:1]]
(use-package esup
  :config
  (setq esup-insignificant-time 0.001))
;; esup:1 ends here

;; [[file:~/.emacs.d/readme.org::*fill-column-indicator][fill-column-indicator:1]]
(use-package fill-column-indicator
  :disabled t
  :config
  (validate-setq fci-rule-width 1
                 fci-rule-color "#5d478b"
                 fci-rule-column 80)
  (define-globalized-minor-mode global-fci-mode fci-mode
    (lambda ()
      (fci-mode 1)))
  (global-fci-mode 1))
;; fill-column-indicator:1 ends here

;; [[file:~/.emacs.d/readme.org::*fixmee][fixmee:1]]
(use-package wiki-nav
  :config
  (global-wiki-nav-mode 1))

(use-package fixmee
  :after wiki-nav
  :config
  (global-fixmee-mode 1))
;; fixmee:1 ends here

;; [[file:~/.emacs.d/readme.org::*flx][flx:1]]
(use-package flx)
;; flx:1 ends here
