readme.org
** flx
 Fuzzy matching for Emacs ... a la Sublime Text. It is needed for fuzzy matching
 in swiper + avy.

#+BEGIN_SRC emacs-lisp
(use-package flx)
#+END_SRC

** flycheck

#+BEGIN_SRC emacs-lisp
(use-package flycheck
  :init (global-flycheck-mode)
  :config
  (setq flycheck-mode-line
        '(:eval
          (pcase flycheck-last-status-change
            (`not-checked nil)
            (`no-checker (propertize " -" 'face 'warning))
            (`running (propertize " ✷" 'face 'success))
            (`errored (propertize " ☠" 'face 'error))
            (`finished
             (let* ((error-counts (flycheck-count-errors flycheck-current-errors))
                    (no-errors (cdr (assq 'error error-counts)))
                    (no-warnings (cdr (assq 'warning error-counts)))
                    (face (cond (no-errors 'error)
                                (no-warnings 'warning)
                                (t 'success))))
               (propertize (format " %s/%s" (or no-errors 0) (or no-warnings 0))
                           'face face)))
            (`interrupted " -")
            (`suspicious '(propertize " ?" 'face 'warning)))))
  )
#+END_SRC

*** Linting prose

[[http://proselint.com/][Proselint]] checks the text for common errors. This creates a flycheck checker
that runs proselint in texty buffers and displays the errors.

#+BEGIN_SRC emacs-lisp
(flycheck-define-checker proselint
  "A linter for prose."
  :command ("proselint" source-inplace)
  :error-patterns
  ((warning line-start (file-name) ":" line ":" column ": "
            (id (one-or-more (not (any " "))))
            (message (one-or-more not-newline)
                     (zero-or-more "\n" (any " ") (one-or-more not-newline)))
            line-end))
  :modes (text-mode markdown-mode gfm-mode org-mode))

(add-to-list 'flycheck-checkers 'proselint)
#+END_SRC

** graphviz-dot-mode

[[https://github.com/ppareit/graphviz-dot-mode][graphviz-dot-mode]] is a mode for the DOT language, used by =graphviz=.

#+BEGIN_SRC emacs-lisp
(use-package graphviz-dot-mode)
#+END_SRC

** page-break-lines

Better looking break lines.

#+BEGIN_SRC emacs-lisp
(use-package page-break-lines
  :init (global-page-break-lines-mode))
#+END_SRC

** paradox

Project for modernizing Emacs’ Package Menu. With package ratings, usage statistics,
customizability, and more.

It is disabled now as I've started using [[https://github.com/raxod502/straight.el][straight.el]].

#+BEGIN_SRC emacs-lisp
(use-package paradox
  ;;:disabled t
  :config
  (setq-default paradox-column-width-package 27
                paradox-column-width-version 13
                paradox-execute-asynchronously t
                paradox-github-token t
                paradox-hide-wiki-packages t)
  (set-face-attribute 'paradox-homepage-button-face nil :italic nil)
  (remove-hook 'paradox--report-buffer-print 'paradox-after-execute-functions))
#+END_SRC

** pass

[[https://github.com/NicolasPetton/pass][pass]] is a major mode for [[https://www.passwordstore.org/][password-store]].

#+BEGIN_SRC emacs-lisp
(use-package pass)
#+END_SRC

** pcache

[[https://github.com/sigma/pcache][pcache]] provides a persistent way of caching data, in a hashtable-like structure.
It relies on `eieio-persistent' in the backend, so that any object that can be
serialized by EIEIO can be stored with pcache.

[[https://github.com/rolandwalker/persistent-soft][persistent-soft]] is a wrapper around pcache.el, providing "soft" fetch and store
routines which never throw an error, but instead return nil on failure.

#+BEGIN_SRC emacs-lisp
(use-package pcache)

(use-package persistent-soft
  :after pcache)
#+END_SRC

** recentf

Recentf is a minor mode that builds a list of recently opened files. This list
is automatically saved across Emacs sessions. You can access the list through a
menu. Here it's set to work together with ivy-switch-buffer.

[[https://github.com/abo-abo/swiper/releases][source 1]] - [[https://www.masteringemacs.org/article/find-files-faster-recent-files-package][source 2]] - [[http://emacsredux.com/blog/2013/04/05/recently-visited-files/][source 3]] - [[https://github.com/emacscollective/no-littering#suggested-settings][source 4]]

#+BEGIN_SRC emacs-lisp
(use-package recentf
  :config
  (recentf-mode t)
  (validate-setq recentf-max-saved-items 10)

  (add-to-list 'recentf-exclude no-littering-var-directory)
  (add-to-list 'recentf-exclude no-littering-etc-directory)
  (add-to-list 'recentf-exclude '("COMMIT_MSG"
                                  "COMMIT_EDITMSG"
                                  "github.*txt$"
                                  ".*png$")))
#+END_SRC

** restart-emacs

#+BEGIN_SRC emacs-lisp
(use-package restart-emacs
 ;; :general (d/leader-keys "qr" 'restart-emacs)
)
#+END_SRC

** ripgrep

Use ripgrep in Emacs.

#+BEGIN_SRC emacs-lisp
(use-package rg)
#+END_SRC

** uniquify

Nicer naming of buffers for files with identical names. Check [[https://github.com/purcell/emacs.d/blob/master/lisp/init-uniquify.el][Steve
Purcell's setup]]. Actually, his whole Emacs setup is doubtless worthy
looking.

#+BEGIN_SRC emacs-lisp
(use-package uniquify
  :ensure nil
  :config
  (setq uniquify-buffer-name-style 'reverse
        uniquify-separator " • "
        uniquify-after-kill-buffer-p t       ; rename after killing uniquified
        uniquify-ignore-buffers-re "^\\*"))  ; don't muck with special buffers
#+END_SRC

** undo-tree

=C-x u= to ~undo-tree-visualize~
C-/ undo
S-C-/ redo

#+BEGIN_SRC emacs-lisp
(use-package undo-tree
  :chords (("uu" . undo-tree-visualize))
  :init
  (global-undo-tree-mode))
#+END_SRC

** volatile-highlights

It provides minor mode volatile-highlights-mode, which brings visual feedback
to some operations (eg. pasting, etc) by highlighting portions relating to the
operations.

#+BEGIN_SRC emacs-lisp
(use-package volatile-highlights
  :config
  (volatile-highlights-mode t))
#+END_SRC

** wgrep

[[https://github.com/mhayashi1120/Emacs-wgrep][wgrep]] is a writable grep buffer and apply the changes to files

You can edit the text in the grep buffer after typing ~C-c C-p~. After that the
changed text is highlighted. The following keybindings are defined:

| Key      | Action                                              |
|----------+-----------------------------------------------------|
| C-c C-e: | Apply the changes to file buffers.                  |
| C-c C-u: | All changes are unmarked and ignored.               |
| C-c C-d: | Mark as delete to current line (including newline). |
| C-c C-r: | Remove the changes in the regiond                   |
| C-c C-p: | Toggle read-only area.                              |
| C-c C-k: | Discard all changes and exit.                       |
| C-x C-q: | Exit wgrep mode.                                    |

#+BEGIN_SRC emacs-lisp
(use-package wgrep
  :config
  (progn
    (with-eval-after-load 'grep
      (bind-key "C-x C-q" #'wgrep-change-to-wgrep-mode grep-mode-map))

    (with-eval-after-load 'wgrep
      (bind-key "C-c C-c" #'wgrep-finish-edit grep-mode-map))))
#+END_SRC

* Window Management
** eyebrowse

#+BEGIN_SRC emacs-lisp
(use-package eyebrowse
;; :general (d/leader-keys
;;            "e"  '(:ignore t :wk "eyebrowse")
;;            "es" 'eyebrowse-switch-to-window-config
;;            "el" 'eyebrowse-next-window-config
;;            "eh" 'eyebrowse-prev-window-config
;;            "er" 'eyebrowse-rename-window-config
;;            "ec" 'eyebrowse-close-window-config
;;            "e'" 'eyebrowse-last-window-config
;;            "e0" 'eyebrowse-switch-to-window-config-0 :wk "workspace 0"
;;            "e1" 'eyebrowse-switch-to-window-config-1
;;            "e2" 'eyebrowse-switch-to-window-config-2
;;            "e3" 'eyebrowse-switch-to-window-config-3
;;            "e4" 'eyebrowse-switch-to-window-config-4
;;            "e5" 'eyebrowse-switch-to-window-config-5
;;            "e6" 'eyebrowse-switch-to-window-config-6
;;            "e7" 'eyebrowse-switch-to-window-config-7
;;            "e8" 'eyebrowse-switch-to-window-config-8
;;            "e9" 'eyebrowse-switch-to-window-config-9)
  :config
  (setq eyebrowse-wrap-around t
        eyebrowse-new-workspace t
        eyebrowse-switch-back-and-forth t)

  (eyebrowse-mode t))
#+END_SRC

** [[https://github.com/nex3/perspective-el][perspective]]

It provides tagged workspaces in Emacs, similar to workspaces in windows managers such as
Awesome and XMonad (and somewhat similar to multiple desktops in Gnome or Spaces in OS X).

Commands are all prefixed by ~C-x x~

| Key        | Command             | What it does                                                    |
|------------+---------------------+-----------------------------------------------------------------|
| s          | persp-switch        | Query a perspective to switch or create                         |
| k          | persp-remove-buffer | Query a buffer to remove from current perspective               |
| c          | persp-kill          | Query a perspective to kill                                     |
| r          | persp-rename        | Rename current perspective                                      |
| a          | persp-add-buffer    | Query an open buffer to add to current perspective              |
| A          | persp-set-buffer    | Add buffer to current perspective and remove it from all others |
| i          | persp-import        | Import a given perspective from another frame.                  |
| n, <right> | persp-next          | Switch to next perspective                                      |
| p, <left>  | persp-prev          | Switch to previous perspective                                  |

#+begin_src emacs-lisp
(use-package perspective
  :config
  (persp-mode))

(use-package persp-projectile
  :config
  (define-key projectile-mode-map (kbd "s-s")
    'projectile-persp-switch-project))
#+end_src

