init.el

;; [[file:~/.emacs.d/readme.org::*flycheck][flycheck:1]]
(use-package flycheck
  :init (global-flycheck-mode)
  :config
  (setq flycheck-mode-line
        '(:eval
          (pcase flycheck-last-status-change
            (`not-checked nil)
            (`no-checker (propertize " -" 'face 'warning))
            (`running (propertize " ✷" 'face 'success))
            (`errored (propertize " ☠" 'face 'error))
            (`finished
             (let* ((error-counts (flycheck-count-errors flycheck-current-errors))
                    (no-errors (cdr (assq 'error error-counts)))
                    (no-warnings (cdr (assq 'warning error-counts)))
                    (face (cond (no-errors 'error)
                                (no-warnings 'warning)
                                (t 'success))))
               (propertize (format " %s/%s" (or no-errors 0) (or no-warnings 0))
                           'face face)))
            (`interrupted " -")
            (`suspicious '(propertize " ?" 'face 'warning)))))
  )
;; flycheck:1 ends here

;; [[file:~/.emacs.d/readme.org::*Linting%20prose][Linting prose:1]]
(flycheck-define-checker proselint
  "A linter for prose."
  :command ("proselint" source-inplace)
  :error-patterns
  ((warning line-start (file-name) ":" line ":" column ": "
            (id (one-or-more (not (any " "))))
            (message (one-or-more not-newline)
                     (zero-or-more "\n" (any " ") (one-or-more not-newline)))
            line-end))
  :modes (text-mode markdown-mode gfm-mode org-mode))

(add-to-list 'flycheck-checkers 'proselint)
;; Linting prose:1 ends here

;; [[file:~/.emacs.d/readme.org::*graphviz-dot-mode][graphviz-dot-mode:1]]
(use-package graphviz-dot-mode)
;; graphviz-dot-mode:1 ends here

;; [[file:~/.emacs.d/readme.org::*page-break-lines][page-break-lines:1]]
(use-package page-break-lines
  :init (global-page-break-lines-mode))
;; page-break-lines:1 ends here

;; [[file:~/.emacs.d/readme.org::*paradox][paradox:1]]
(use-package paradox
  ;;:disabled t
  :config
  (setq-default paradox-column-width-package 27
                paradox-column-width-version 13
                paradox-execute-asynchronously t
                paradox-github-token t
                paradox-hide-wiki-packages t)
  (set-face-attribute 'paradox-homepage-button-face nil :italic nil)
  (remove-hook 'paradox--report-buffer-print 'paradox-after-execute-functions))
;; paradox:1 ends here

;; [[file:~/.emacs.d/readme.org::*pass][pass:1]]
(use-package pass)
;; pass:1 ends here

;; [[file:~/.emacs.d/readme.org::*pcache][pcache:1]]
(use-package pcache)

(use-package persistent-soft
  :after pcache)
;; pcache:1 ends here

;; [[file:~/.emacs.d/readme.org::*recentf][recentf:1]]
(use-package recentf
  :config
  (recentf-mode t)
  (validate-setq recentf-max-saved-items 10)

  (add-to-list 'recentf-exclude no-littering-var-directory)
  (add-to-list 'recentf-exclude no-littering-etc-directory)
  (add-to-list 'recentf-exclude '("COMMIT_MSG"
                                  "COMMIT_EDITMSG"
                                  "github.*txt$"
                                  ".*png$")))
;; recentf:1 ends here

;; [[file:~/.emacs.d/readme.org::*restart-emacs][restart-emacs:1]]
(use-package restart-emacs
 ;; :general (d/leader-keys "qr" 'restart-emacs)
)
;; restart-emacs:1 ends here

;; [[file:~/.emacs.d/readme.org::*ripgrep][ripgrep:1]]
(use-package rg)
;; ripgrep:1 ends here

;; [[file:~/.emacs.d/readme.org::*uniquify][uniquify:1]]
(use-package uniquify
  :ensure nil
  :config
  (setq uniquify-buffer-name-style 'reverse
        uniquify-separator " • "
        uniquify-after-kill-buffer-p t       ; rename after killing uniquified
        uniquify-ignore-buffers-re "^\\*"))  ; don't muck with special buffers
;; uniquify:1 ends here

;; [[file:~/.emacs.d/readme.org::*undo-tree][undo-tree:1]]
(use-package undo-tree
  :chords (("uu" . undo-tree-visualize))
  :init
  (global-undo-tree-mode))
;; undo-tree:1 ends here

;; [[file:~/.emacs.d/readme.org::*volatile-highlights][volatile-highlights:1]]
(use-package volatile-highlights
  :config
  (volatile-highlights-mode t))
;; volatile-highlights:1 ends here

;; [[file:~/.emacs.d/readme.org::*wgrep][wgrep:1]]
(use-package wgrep
  :config
  (progn
    (with-eval-after-load 'grep
      (bind-key "C-x C-q" #'wgrep-change-to-wgrep-mode grep-mode-map))

    (with-eval-after-load 'wgrep
      (bind-key "C-c C-c" #'wgrep-finish-edit grep-mode-map))))
;; wgrep:1 ends here

;; [[file:~/.emacs.d/readme.org::*eyebrowse][eyebrowse:1]]
(use-package eyebrowse
;; :general (d/leader-keys
;;            "e"  '(:ignore t :wk "eyebrowse")
;;            "es" 'eyebrowse-switch-to-window-config
;;            "el" 'eyebrowse-next-window-config
;;            "eh" 'eyebrowse-prev-window-config
;;            "er" 'eyebrowse-rename-window-config
;;            "ec" 'eyebrowse-close-window-config
;;            "e'" 'eyebrowse-last-window-config
;;            "e0" 'eyebrowse-switch-to-window-config-0 :wk "workspace 0"
;;            "e1" 'eyebrowse-switch-to-window-config-1
;;            "e2" 'eyebrowse-switch-to-window-config-2
;;            "e3" 'eyebrowse-switch-to-window-config-3
;;            "e4" 'eyebrowse-switch-to-window-config-4
;;            "e5" 'eyebrowse-switch-to-window-config-5
;;            "e6" 'eyebrowse-switch-to-window-config-6
;;            "e7" 'eyebrowse-switch-to-window-config-7
;;            "e8" 'eyebrowse-switch-to-window-config-8
;;            "e9" 'eyebrowse-switch-to-window-config-9)
  :config
  (setq eyebrowse-wrap-around t
        eyebrowse-new-workspace t
        eyebrowse-switch-back-and-forth t)

  (eyebrowse-mode t))
;; eyebrowse:1 ends here

;; [[file:~/.emacs.d/readme.org::*%5B%5Bhttps://github.com/nex3/perspective-el%5D%5Bperspective%5D%5D][[[https://github.com/nex3/perspective-el][perspective]]:1]]
(use-package perspective
  :config
  (persp-mode))

(use-package persp-projectile
  :config
  (define-key projectile-mode-map (kbd "s-s")
    'projectile-persp-switch-project))
;; [[https://github.com/nex3/perspective-el][perspective]]:1 ends here
