readme.org
** shackle

#+BEGIN_SRC emacs-lisp
(use-package shackle
  :config
  (validate-setq
   shackle-default-alignment 'below
   shackle-default-size 8
   shackle-rules '(("^\\*ftp " :noselect t :autokill t :noesc t)
                   ;; built-in (emacs)
                   ("*ert*" :same t :modeline t)
                   ("*info*" :size 0.5 :select t :autokill t)
                   ("*Backtrace*" :size 20 :noselect t)
                   ("*Warnings*"  :size 8  :noselect t)
                   ("*Messages*"  :size 12 :noselect t)
                   ("*Help*" :size 0.3)
                   ("^\\*.*Shell Command.*\\*$" :regexp t :size 20 :noselect t :autokill t)
                   (apropos-mode :size 0.3 :autokill t :autoclose t)
                   (Buffer-menu-mode :size 20 :autokill t)
                   (comint-mode :noesc t)
                   (grep-mode :size 25 :noselect t :autokill t)
                   (profiler-report-mode :size 0.3 :regexp t :autokill t :modeline minimal)
                   (tabulated-list-mode :noesc t)
                   (special-mode :noselect t :autokill t :autoclose t)
                   ("^\\*"  :regexp t :noselect t :autokill t)
                   ("^ \\*" :regexp t :size 12 :noselect t :autokill t :autoclose t)))

  (shackle-mode))
#+END_SRC

* Navigation
** ace-link

#+BEGIN_SRC emacs-lisp
(use-package ace-link
  :config (ace-link-setup-default))
#+END_SRC

** ace-window

#+BEGIN_SRC emacs-lisp
(use-package ace-window
  :bind ([remap other-window] . ace-window)
  :init
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
  ;;(setq aw-background nil)
  (setq aw-dispatch-always t)

  ;; customize face of hint character
  (custom-set-faces '(aw-leading-char-face
                      ((t (:inherit ace-jump-face-foreground
                                    :height 3.0))))))
#+END_SRC

** avy
avy is a GNU Emacs package for jumping to visible text using a char-based
decision tree. See also ace-jump-mode and vim-easymotion - avy uses the same
idea.

#+BEGIN_SRC emacs-lisp
(use-package avy
  :chords (("jj" . avy-goto-word-or-subword-1))
  :config
  (setq avy-background t
        avy-all-windows t
        avy-style 'at-full
        avy-case-fold-search nil)

  (set-face-attribute 'avy-lead-face nil
                      :foreground "gold"
                      :weight 'bold
                      :background nil)
  (set-face-attribute 'avy-lead-face-0 nil
                      :foreground "deep sky blue"
                      :weight 'bold
                      :background nil))
#+END_SRC

* Version Control
** [[https://magit.vc][magit]]

A Git Porcelain inside Emacs.

#+BEGIN_SRC emacs-lisp
(use-package magit
  :hook (after-save . magit-after-save-refresh-status) ; refreshes magit status when file is saved
  :config
  (setq magit-completing-read-function 'ivy-completing-read
        magit-display-buffer-function 'magit-display-buffer-fullframe-status-topleft-v1)

  ;; automatically refreshes magit status after file is saved
  ;;(add-hook 'after-save-hook 'magit-after-save-refresh-status)
  )
#+END_SRC

** git-gutter

#+BEGIN_SRC emacs-lisp
(use-package git-gutter
  :init
  (global-git-gutter-mode +1))
#+END_SRC

** git-timemachine

#+begin_src emacs-lisp
(use-package git-timemachine
  :commands git-timemachine)
#+end_src

* Programming
** General settings
*** [[https://github.com/Malabarba/aggressive-indent-mode][aggressive-indent]]

It keeps the code always indented.

#+begin_src emacs-lisp
(use-package aggressive-indent
  :config
  (global-aggressive-indent-mode 1)
  (add-to-list 'aggressive-indent-excluded-modes 'html-mode))
#+end_src

*** [[https://github.com/DarthFennec/highlight-indent-guides][highligh-indent-guides]]

It is a minor mode to highlight indentation.

#+BEGIN_SRC emacs-lisp
(use-package highlight-indent-guides
  :disabled t
  :hook (prog-mode . highlight-indent-guides-mode)
  :config
  (validate-setq highlight-indent-guides-method 'character))
#+END_SRC

*** [[https://github.com/Fuco1/smartparens][smartparens]]

It is a minor mode that deals with parens pairs and tries to be smart about it. There are
good tips [[https://ebzzry.github.io/emacs-pairs.html][here]].

#+begin_src emacs-lisp
(use-package lispy
  :hook (prog-mode . lispy-mode))
#+end_src

*** [[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]]

It helps visualizing delimiters, putting different colours on parenthesis depending on
their depth.

#+BEGIN_SRC emacs-lisp
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
#+END_SRC
