init.el

;; [[file:~/.emacs.d/readme.org::*shackle][shackle:1]]
(use-package shackle
  :config
  (validate-setq
   shackle-default-alignment 'below
   shackle-default-size 8
   shackle-rules '(("^\\*ftp " :noselect t :autokill t :noesc t)
                   ;; built-in (emacs)
                   ("*ert*" :same t :modeline t)
                   ("*info*" :size 0.5 :select t :autokill t)
                   ("*Backtrace*" :size 20 :noselect t)
                   ("*Warnings*"  :size 8  :noselect t)
                   ("*Messages*"  :size 12 :noselect t)
                   ("*Help*" :size 0.3)
                   ("^\\*.*Shell Command.*\\*$" :regexp t :size 20 :noselect t :autokill t)
                   (apropos-mode :size 0.3 :autokill t :autoclose t)
                   (Buffer-menu-mode :size 20 :autokill t)
                   (comint-mode :noesc t)
                   (grep-mode :size 25 :noselect t :autokill t)
                   (profiler-report-mode :size 0.3 :regexp t :autokill t :modeline minimal)
                   (tabulated-list-mode :noesc t)
                   (special-mode :noselect t :autokill t :autoclose t)
                   ("^\\*"  :regexp t :noselect t :autokill t)
                   ("^ \\*" :regexp t :size 12 :noselect t :autokill t :autoclose t)))

  (shackle-mode))
;; shackle:1 ends here

;; [[file:~/.emacs.d/readme.org::*ace-link][ace-link:1]]
(use-package ace-link
  :config (ace-link-setup-default))
;; ace-link:1 ends here

;; [[file:~/.emacs.d/readme.org::*ace-window][ace-window:1]]
(use-package ace-window
  :bind ([remap other-window] . ace-window)
  :init
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
  ;;(setq aw-background nil)
  (setq aw-dispatch-always t)

  ;; customize face of hint character
  (custom-set-faces '(aw-leading-char-face
                      ((t (:inherit ace-jump-face-foreground
                                    :height 3.0))))))
;; ace-window:1 ends here

;; [[file:~/.emacs.d/readme.org::*avy][avy:1]]
(use-package avy
  :chords (("jj" . avy-goto-word-or-subword-1))
  :config
  (setq avy-background t
        avy-all-windows t
        avy-style 'at-full
        avy-case-fold-search nil)

  (set-face-attribute 'avy-lead-face nil
                      :foreground "gold"
                      :weight 'bold
                      :background nil)
  (set-face-attribute 'avy-lead-face-0 nil
                      :foreground "deep sky blue"
                      :weight 'bold
                      :background nil))
;; avy:1 ends here

;; [[file:~/.emacs.d/readme.org::*%5B%5Bhttps://magit.vc%5D%5Bmagit%5D%5D][[[https://magit.vc][magit]]:1]]
(use-package magit
  :hook (after-save . magit-after-save-refresh-status) ; refreshes magit status when file is saved
  :config
  (setq magit-completing-read-function 'ivy-completing-read
        magit-display-buffer-function 'magit-display-buffer-fullframe-status-topleft-v1)

  ;; automatically refreshes magit status after file is saved
  ;;(add-hook 'after-save-hook 'magit-after-save-refresh-status)
  )
;; [[https://magit.vc][magit]]:1 ends here

;; [[file:~/.emacs.d/readme.org::*git-gutter][git-gutter:1]]
(use-package git-gutter
  :init
  (global-git-gutter-mode +1))
;; git-gutter:1 ends here

;; [[file:~/.emacs.d/readme.org::*git-timemachine][git-timemachine:1]]
(use-package git-timemachine
  :commands git-timemachine)
;; git-timemachine:1 ends here

;; [[file:~/.emacs.d/readme.org::*%5B%5Bhttps://github.com/Malabarba/aggressive-indent-mode%5D%5Baggressive-indent%5D%5D][[[https://github.com/Malabarba/aggressive-indent-mode][aggressive-indent]]:1]]
(use-package aggressive-indent
  :config
  (global-aggressive-indent-mode 1)
  (add-to-list 'aggressive-indent-excluded-modes 'html-mode))
;; [[https://github.com/Malabarba/aggressive-indent-mode][aggressive-indent]]:1 ends here

;; [[file:~/.emacs.d/readme.org::*%5B%5Bhttps://github.com/DarthFennec/highlight-indent-guides%5D%5Bhighligh-indent-guides%5D%5D][[[https://github.com/DarthFennec/highlight-indent-guides][highligh-indent-guides]]:1]]
(use-package highlight-indent-guides
  :disabled t
  :hook (prog-mode . highlight-indent-guides-mode)
  :config
  (validate-setq highlight-indent-guides-method 'character))
;; [[https://github.com/DarthFennec/highlight-indent-guides][highligh-indent-guides]]:1 ends here

;; [[file:~/.emacs.d/readme.org::*%5B%5Bhttps://github.com/Fuco1/smartparens%5D%5Bsmartparens%5D%5D][[[https://github.com/Fuco1/smartparens][smartparens]]:1]]
(use-package lispy
  :hook (prog-mode . lispy-mode))
;; [[https://github.com/Fuco1/smartparens][smartparens]]:1 ends here

;; [[file:~/.emacs.d/readme.org::*%5B%5Bhttps://github.com/Fanael/rainbow-delimiters%5D%5Brainbow-delimiters%5D%5D][[[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]]:1]]
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
;; [[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]]:1 ends here

;; [[file:~/.emacs.d/readme.org::*company][company:1]]
;; (use-package company
