readme.org
** company

[[http://company-mode.github.io/][Company]] is a text completion framework for Emacs. The name stands for “complete anything”.
It uses pluggable back-ends and front-ends to retrieve and display completion candidates.

It comes with several back-ends such as Elisp, Clang, Semantic, Eclim, Ropemacs, Ispell,
CMake, BBDB, Yasnippet, dabbrev, etags, gtags, files, keywords and a few others.

The CAPF back-end provides a bridge to the standard completion-at-point-functions
facility, and thus works with any major mode that defines a proper completion function.

#+BEGIN_SRC emacs-lisp
;; (use-package company
;;   :hook (after-init . global-company-mode)
;;   :bind (("C-c /" . company-files))                    ; force complete file names on "C-c /" key
;;   :config
;;   (setq company-tooltip-limit 20                       ; bigger popup window
;;         company-tooltip-align-annotations 't           ; align annotations to the right tooltip border
;;         company-idle-delay .3                          ; decrease delay before autocompletion popup shows
;;         company-begin-commands '(self-insert-command)) ; start autocompletion only after typing
;;   )

(use-package company
  :preface (message "[INIT] Package: Company")
  :commands company-mode
  :hook (prog-mode . company-mode))

(use-package company-box
  :disabled t
  :hook (company-mode . company-box-mode)
  :config
  (setq company-box-icons-unknown 'fa_question_circle)

  (setq company-box-icons-elisp
        '((fa_tag :face font-lock-function-name-face) ;; Function
          (fa_cog :face font-lock-variable-name-face) ;; Variable
          (fa_cube :face font-lock-constant-face) ;; Feature
          (md_color_lens :face font-lock-doc-face))) ;; Face

  (setq company-box-icons-yasnippet 'fa_bookmark)

  (setq company-box-icons-lsp
        '((1 . fa_text_height) ;; Text
          (2 . (fa_tags :face font-lock-function-name-face)) ;; Method
          (3 . (fa_tag :face font-lock-function-name-face)) ;; Function
          (4 . (fa_tag :face font-lock-function-name-face)) ;; Constructor
          (5 . (fa_cog :foreground "#FF9800")) ;; Field
          (6 . (fa_cog :foreground "#FF9800")) ;; Variable
          (7 . (fa_cube :foreground "#7C4DFF")) ;; Class
          (8 . (fa_cube :foreground "#7C4DFF")) ;; Interface
          (9 . (fa_cube :foreground "#7C4DFF")) ;; Module
          (10 . (fa_cog :foreground "#FF9800")) ;; Property
          (11 . md_settings_system_daydream) ;; Unit
          (12 . (fa_cog :foreground "#FF9800")) ;; Value
          (13 . (md_storage :face font-lock-type-face)) ;; Enum
          (14 . (md_closed_caption :foreground "#009688")) ;; Keyword
          (15 . md_closed_caption) ;; Snippet
          (16 . (md_color_lens :face font-lock-doc-face)) ;; Color
          (17 . fa_file_text_o) ;; File
          (18 . md_refresh) ;; Reference
          (19 . fa_folder_open) ;; Folder
          (20 . (md_closed_caption :foreground "#009688")) ;; EnumMember
          (21 . (fa_square :face font-lock-constant-face)) ;; Constant
          (22 . (fa_cube :face font-lock-type-face)) ;; Struct
          (23 . fa_calendar) ;; Event
          (24 . fa_square_o) ;; Operator
          (25 . fa_arrows)) ;; TypeParameter
        )
  )

(use-package company-statistics
  :after company
  :hook (after-init . company-statistics-mode))

(use-package slime-company
  :after company
  :config
  (slime-setup '(slime-fancy slime-company)))

(use-package company-ansible
  :after company
  :config
  (add-to-list 'company-backends 'company-ansible))
#+END_SRC

** language server protocol

#+BEGIN_SRC emacs-lisp
(use-package lsp-mode
  ;; :hook
  ;; (prog-mode . lsp-mode)
  ;;(lsp-after-open . lsp-enable-imenu)
  :commands (lsp-mode
             lsp-define-stdio-client
             lsp-client-on-notification
             lsp-make-traverser))

(use-package lsp-ui
  :preface  (message "[INIT] Package: LSP UI")
  :after    lsp-mode
  :hook     ((lsp-mode  . lsp-ui-mode)
             (prog-mode . flycheck-mode))
  :commands (lsp-ui-mode
             lsp-ui-peek-find-definistions
             lsp-ui-peek-find-references)
  :config   (setq lsp-ui-doc-enable  t
		  lsp-ui-flychekc-enable t
		  lsp-ui-imenu-enale     nil
		  lsp-ui-peek-enable     t
		  lsp-ui-sideline-enable nil))

(use-package company-lsp
  :preface (message "[INIT] Package: Company LSP")
  :after (lsp-mode company)
  :config
  (push 'company-lsp company-backends))
#+END_SRC

** snippets
*** yasnippet

 [[https://github.com/joaotavora/yasnippet][YASnippet]] is a powerful snippet tool for Emacs.

#+BEGIN_SRC emacs-lisp
(use-package yasnippet-snippets)

(use-package yasnippet
  :config
  (yas-global-mode 1))
#+END_SRC

*** yankpad

[[https://github.com/Kungsgeten/yankpad][yankpad]] is an amazing complement to [[https://github.com/joaotavora/yasnippet][YASnippet]]. It allows having all your snippets in a
single ~org~ file, so you can take advantage of the powerful ~org-mode~ section/subsection
structure. To understand how it works check this [[https://kungsgeten.github.io/yankpad.html][blog post]].

#+BEGIN_SRC emacs-lisp
(use-package yankpad
  :config
  (validate-setq yankpad-file "~/org/yankpad.org"))
#+END_SRC

** text notation
*** ascii-doc

[[http://www.methods.co.nz/asciidoc/][AsciiDoc]] is a text document format for writing short documents, articles, books
and UNIX man pages. AsciiDoc files can be translated to HTML and DocBook
markups.

[[https://github.com/sensorflo/adoc-mode][adoc-mode]] is an Emacs major mode for editing AsciiDoc files. It emphasizes on
the idea that the document is highlighted so it pretty much looks like the final
output. What must be bold is bold, what must be italic is italic etc. Meta
characters are naturally still visible, but in a faint way, so they can be
easily ignored.

#+BEGIN_SRC emacs-lisp
(use-package adoc-mode
  :config
  (autoload 'adoc-mode "adoc-mode" nil t))
#+END_SRC
*** html

#+begin_src emacs-lisp
(use-package simple-httpd
  :disabled t
  :config
  ;;(setq httpd-root "/var/www")
  (httpd-start))

(use-package htmlize)
#+end_src

*** jinja2

#+BEGIN_SRC emacs-lisp
(use-package jinja2-mode
  :mode "\\.j2\\'")
#+END_SRC

*** json-mode

Installs json-mode and make its reformat keybinding match the global default.

#+BEGIN_SRC emacs-lisp
(use-package json-mode
  :commands json-mode
  :config
  (bind-keys :map json-mode-map
             ("C-c <tab>" . json-mode-beautify)))
#+END_SRC

*** markdown

Using also [[https://github.com/skeeto/impatient-mode][impatient-mode]] here, which allows live preview of the Markdown document. It is
developed for previewing HTML, but the functions included here allows the markdown
preview.

To use any of the functions, just =M-x imp-set-user-filter= in the markdown buffer, and
supply =markdown-html= when it asks for the function. Taken from [[http://wikemacs.org/wiki/Markdown#Live_preview_as_you_type][Wikemacs]].

#+BEGIN_SRC emacs-lisp
(use-package markdown-mode)

(use-package impatient-mode
  :disabled t
  :config
  (defun markdown-html (buffer)
    (princ (with-current-buffer buffer
             (format "<!DOCTYPE html><html><title>Impatient Markdown</title><xmp theme=\"united\" style=\"display:none;\"> %s  </xmp><script src=\"http://strapdownjs.com/v/0.2/strapdown.js\"></script></html>"
                     (buffer-substring-no-properties (point-min) (point-max))))
           (current-buffer)))

  (defun markdown-filter (buffer)
    (princ
     (with-temp-buffer
       (let ((tmpname (buffer-name)))
         (set-buffer buffer)
         (set-buffer (markdown tmpname)) ; the function markdown is in `markdown-mode.el'
         (buffer-string)))
     (current-buffer)))
  )

(use-package markdown-toc)
#+END_SRC

*** yaml

#+BEGIN_SRC emacs-lisp
(use-package yaml-mode)
#+END_SRC

** languages
*** python

#+BEGIN_SRC emacs-lisp
;; (use-package lsp-python
;;   :hook (python-mode . lsp-python-enable))

(setq python-indent 2)

(use-package anaconda-mode
  :hook ((python-mode . anaconda-mode)
         (python-mode . anaconda-eldoc-mode))
  :init
  (add-to-list 'auto-mode-alist '("\\.py$" . python-mode))
)

;; (use-package python
;;   :mode ("\\.py\\'" . python-mode)
;;   :hook ((python-mode . lsp-mode)
;; 	 (python-mode . lsp-python-enable)))

(use-package pyenv-mode
  :init
  (add-to-list 'exec-path "~/.pyenv/shims")
  (setenv "WORKON_HOME" "~/.pyenv/versions/")
  :config
  (pyenv-mode)
  :bind
  ("C-x p e" . pyenv-activate-current-project))


(defun projectile-pyenv-mode-set ()
  "Set pyenv version matching project name."
  (let ((project (projectile-project-name)))
    (if (member project (pyenv-mode-versions))
        (pyenv-mode-set project)
      (pyenv-mode-unset))))

(add-hook 'projectile-after-switch-project-hook 'projectile-pyenv-mode-set)

	#+END_SRC

