init.el
;;   :hook (after-init . global-company-mode)
;;   :bind (("C-c /" . company-files))                    ; force complete file names on "C-c /" key
;;   :config
;;   (setq company-tooltip-limit 20                       ; bigger popup window
;;         company-tooltip-align-annotations 't           ; align annotations to the right tooltip border
;;         company-idle-delay .3                          ; decrease delay before autocompletion popup shows
;;         company-begin-commands '(self-insert-command)) ; start autocompletion only after typing
;;   )

(use-package company
  :preface (message "[INIT] Package: Company")
  :commands company-mode
  :hook (prog-mode . company-mode))

(use-package company-box
  :disabled t
  :hook (company-mode . company-box-mode)
  :config
  (setq company-box-icons-unknown 'fa_question_circle)

  (setq company-box-icons-elisp
        '((fa_tag :face font-lock-function-name-face) ;; Function
          (fa_cog :face font-lock-variable-name-face) ;; Variable
          (fa_cube :face font-lock-constant-face) ;; Feature
          (md_color_lens :face font-lock-doc-face))) ;; Face

  (setq company-box-icons-yasnippet 'fa_bookmark)

  (setq company-box-icons-lsp
        '((1 . fa_text_height) ;; Text
          (2 . (fa_tags :face font-lock-function-name-face)) ;; Method
          (3 . (fa_tag :face font-lock-function-name-face)) ;; Function
          (4 . (fa_tag :face font-lock-function-name-face)) ;; Constructor
          (5 . (fa_cog :foreground "#FF9800")) ;; Field
          (6 . (fa_cog :foreground "#FF9800")) ;; Variable
          (7 . (fa_cube :foreground "#7C4DFF")) ;; Class
          (8 . (fa_cube :foreground "#7C4DFF")) ;; Interface
          (9 . (fa_cube :foreground "#7C4DFF")) ;; Module
          (10 . (fa_cog :foreground "#FF9800")) ;; Property
          (11 . md_settings_system_daydream) ;; Unit
          (12 . (fa_cog :foreground "#FF9800")) ;; Value
          (13 . (md_storage :face font-lock-type-face)) ;; Enum
          (14 . (md_closed_caption :foreground "#009688")) ;; Keyword
          (15 . md_closed_caption) ;; Snippet
          (16 . (md_color_lens :face font-lock-doc-face)) ;; Color
          (17 . fa_file_text_o) ;; File
          (18 . md_refresh) ;; Reference
          (19 . fa_folder_open) ;; Folder
          (20 . (md_closed_caption :foreground "#009688")) ;; EnumMember
          (21 . (fa_square :face font-lock-constant-face)) ;; Constant
          (22 . (fa_cube :face font-lock-type-face)) ;; Struct
          (23 . fa_calendar) ;; Event
          (24 . fa_square_o) ;; Operator
          (25 . fa_arrows)) ;; TypeParameter
        )
  )

(use-package company-statistics
  :after company
  :hook (after-init . company-statistics-mode))

(use-package slime-company
  :after company
  :config
  (slime-setup '(slime-fancy slime-company)))

(use-package company-ansible
  :after company
  :config
  (add-to-list 'company-backends 'company-ansible))
;; company:1 ends here

;; [[file:~/.emacs.d/readme.org::*language%20server%20protocol][language server protocol:1]]
(use-package lsp-mode
  ;; :hook
  ;; (prog-mode . lsp-mode)
  ;;(lsp-after-open . lsp-enable-imenu)
  :commands (lsp-mode
             lsp-define-stdio-client
             lsp-client-on-notification
             lsp-make-traverser))

(use-package lsp-ui
  :preface  (message "[INIT] Package: LSP UI")
  :after    lsp-mode
  :hook     ((lsp-mode  . lsp-ui-mode)
             (prog-mode . flycheck-mode))
  :commands (lsp-ui-mode
             lsp-ui-peek-find-definistions
             lsp-ui-peek-find-references)
  :config   (setq lsp-ui-doc-enable  t
		  lsp-ui-flychekc-enable t
		  lsp-ui-imenu-enale     nil
		  lsp-ui-peek-enable     t
		  lsp-ui-sideline-enable nil))

(use-package company-lsp
  :preface (message "[INIT] Package: Company LSP")
  :after (lsp-mode company)
  :config
  (push 'company-lsp company-backends))
;; language server protocol:1 ends here

;; [[file:~/.emacs.d/readme.org::*yasnippet][yasnippet:1]]
(use-package yasnippet-snippets)

(use-package yasnippet
  :config
  (yas-global-mode 1))
;; yasnippet:1 ends here

;; [[file:~/.emacs.d/readme.org::*yankpad][yankpad:1]]
(use-package yankpad
  :config
  (validate-setq yankpad-file "~/org/yankpad.org"))
;; yankpad:1 ends here

;; [[file:~/.emacs.d/readme.org::*ascii-doc][ascii-doc:1]]
(use-package adoc-mode
  :config
  (autoload 'adoc-mode "adoc-mode" nil t))
;; ascii-doc:1 ends here

;; [[file:~/.emacs.d/readme.org::*html][html:1]]
(use-package simple-httpd
  :disabled t
  :config
  ;;(setq httpd-root "/var/www")
  (httpd-start))

(use-package htmlize)
;; html:1 ends here

;; [[file:~/.emacs.d/readme.org::*jinja2][jinja2:1]]
(use-package jinja2-mode
  :mode "\\.j2\\'")
;; jinja2:1 ends here

;; [[file:~/.emacs.d/readme.org::*json-mode][json-mode:1]]
(use-package json-mode
  :commands json-mode
  :config
  (bind-keys :map json-mode-map
             ("C-c <tab>" . json-mode-beautify)))
;; json-mode:1 ends here

;; [[file:~/.emacs.d/readme.org::*markdown][markdown:1]]
(use-package markdown-mode)

(use-package impatient-mode
  :disabled t
  :config
  (defun markdown-html (buffer)
    (princ (with-current-buffer buffer
             (format "<!DOCTYPE html><html><title>Impatient Markdown</title><xmp theme=\"united\" style=\"display:none;\"> %s  </xmp><script src=\"http://strapdownjs.com/v/0.2/strapdown.js\"></script></html>"
                     (buffer-substring-no-properties (point-min) (point-max))))
           (current-buffer)))

  (defun markdown-filter (buffer)
    (princ
     (with-temp-buffer
       (let ((tmpname (buffer-name)))
         (set-buffer buffer)
         (set-buffer (markdown tmpname)) ; the function markdown is in `markdown-mode.el'
         (buffer-string)))
     (current-buffer)))
  )

(use-package markdown-toc)
;; markdown:1 ends here

;; [[file:~/.emacs.d/readme.org::*yaml][yaml:1]]
(use-package yaml-mode)
;; yaml:1 ends here

;; [[file:~/.emacs.d/readme.org::*python][python:1]]
;; (use-package lsp-python
;;   :hook (python-mode . lsp-python-enable))

(setq python-indent 2)

(use-package anaconda-mode
  :hook ((python-mode . anaconda-mode)
         (python-mode . anaconda-eldoc-mode))
  :init
  (add-to-list 'auto-mode-alist '("\\.py$" . python-mode))
)

;; (use-package python
;;   :mode ("\\.py\\'" . python-mode)
;;   :hook ((python-mode . lsp-mode)
;; 	 (python-mode . lsp-python-enable)))

(use-package pyenv-mode
  :init
  (add-to-list 'exec-path "~/.pyenv/shims")
  (setenv "WORKON_HOME" "~/.pyenv/versions/")
  :config
  (pyenv-mode)
  :bind
  ("C-x p e" . pyenv-activate-current-project))


(defun projectile-pyenv-mode-set ()
  "Set pyenv version matching project name."
  (let ((project (projectile-project-name)))
    (if (member project (pyenv-mode-versions))
        (pyenv-mode-set project)
      (pyenv-mode-unset))))

(add-hook 'projectile-after-switch-project-hook 'projectile-pyenv-mode-set)
;; python:1 ends here
