readme.org
*** rust

#+BEGIN_SRC emacs-lisp
(use-package rust-mode
  :mode "\\.rs\\'"
  :init
  (setq rust-format-on-save t))

(use-package lsp-rust
  :after lsp-mode)
#+END_SRC

*** slime

#+BEGIN_SRC emacs-lisp :tangle no
(use-package slime
  :config
  (load (expand-file-name "~/quicklisp/slime-helper.el"))
  (setq inferior-lisp-program "sbcl"))

(use-package elisp-slime-nav
  :after slime
  :config
  (dolist (hook '(emacs-lisp-mode-hook ielm-mode-hook))
    (add-hook hook 'turn-on-elisp-slime-nav-mode)))
#+END_SRC

*** sql
Emacs has SQLi mode buitin, which work pretty well to connect to databases. Here
I am configuring it for PostgreSQL, of course.

[[https://github.com/Trevoke/sqlup-mode.el][sqlup-mode]] is a minor mode to upcase SQL keyword and functions.

[[https://github.com/alex-hhh/emacs-sql-indent][sql-indent]] is a syntax based indentation for SQL files inside GNU Emacs.

#+BEGIN_SRC emacs-lisp
;; Make SQLi default to PostgreSQL syntax highlighti
;; https://blogs.gentoo.org/titanofold/2011/05/17/postgresql-syntax-highlighting-in-emacs/
(eval-after-load "sql"
  '(progn (sql-set-product 'postgres)))

;; Set default config for login
;; https://truongtx.me/2014/08/23/setup-emacs-as-an-sql-database-client/
(setq sql-postgres-login-params
      '((user :default "postgres")
        (database :default "postgres")
        (server)))

;; Truncate lines to better visualize many columns tables
;; Automatically renames the *SQL* buffer to *SQL user/database*
(add-hook 'sql-interactive-mode-hook
          (lambda ()
            (toggle-truncate-lines t)
            (sql-rename-buffer)))

(use-package sqlup-mode
  :bind (("C-c u" . sqlup-capitalize-keywords-in-region))
  :config
  (add-hook 'sql-mode-hook 'sqlup-mode)                ; capitalize keywords in SQL mode
  (add-hook 'sql-interactive-mode-hook 'sqlup-mode))   ; and in an interactive session (e.g. psql)

(use-package sql-indent
  :config
  (add-hook 'sql-mode-hook 'sqlind-minor-mode))
#+END_SRC

* Devops
** eshell

[[https://github.com/dakrone/eos/blob/master/eos-shell.org][source]]

My frustration with shells makes me enjoy Emacs Shell, but there are some
significant differences to address. To this end, I [[http://www.howardism.org/Technical/Emacs/eshell-fun.html][documented most features]].

#+BEGIN_SRC emacs-lisp
(setenv "LANG" "en_US.UTF-8")
(setenv "PAGER" "cat")
(setq eshell-scroll-to-bottom-on-input t)

;; Define a keybinding to get to your eshell quickly.
(global-set-key (kbd "C-c e") 'eshell)

;; Visual commands are commands which require a proper terminal.
;; eshell will run them in a term buffer when you invoke them.
(setq eshell-visual-commands
      '("less" "tmux" "htop" "top" "bash" "zsh" "fish"))
(setq eshell-visual-subcommands
      '(("git" "log" "l" "diff" "show")))

(setq eshell-cmpl-cycle-completions t)  ;TAB for suggestion

(add-hook 'eshell-mode-hook
          (lambda ()
            (setq-local show-trailing-whitespace nil)
            (semantic-mode -1)
            (hl-line-mode -1)
            (global-hl-line-mode -1)))

;; Define a pretty prompt.
(use-package eshell-git-prompt
  :config
  (eshell-git-prompt-use-theme 'powerline))

(add-hook 'eshell-mode-hook
          (lambda ()
            (define-key eshell-mode-map
              (kbd "<tab>") 'completion-at-point)))


;; Like Plan-9 shell
(use-package em-smart
  :ensure nil
  :init
  (add-hook 'eshell-mode-hook 'eshell-smart-initialize)
  :config
  (setq eshell-where-to-jump 'begin
        eshell-review-quick-commands nil
        eshell-smart-space-goes-to-end t))

(use-package eshell-bookmark
  :hook (eshell-mode . eshell-bookmark-setup))
#+END_SRC

*** better-shell

[[https://github.com/killdash9/better-shell][better-shell]] simplifies shell management and sudo access.

#+BEGIN_SRC emacs-lisp
(use-package better-shell
  :bind (("C-'" . better-shell-shell)
         ("C-;" . better-shell-remote-open)))
#+END_SRC

*** eshell history with counsel

Navigate eshell history using counsel. Keybinding to `C-c C-l` - [[http://informatica.boccaperta.com/m-x-emacs-history-di-eshell-con-counsel/][Boccaperta]]

FIXME: There's a bug on Eshell that forces the key-binding to be include using
the `add-hook` below (not nice!). As soon as the bug is fixed, add the
key-binding using `bind` from use-package:

:bind (:map eshell-mode-map
            ("C-c C-l" . mu-counsel-esh-history))

 #+BEGIN_SRC emacs-lisp
(defun mu-counsel-esh-history ()
  "Browse Eshell history."
  (interactive)
  (setq ivy-completion-beg (point))
  (setq ivy-completion-end (point))
  (ivy-read "Symbol name: "
            (delete-dups
             (ring-elements eshell-history-ring))
            :action #'ivy-completion-in-region-action))

(add-hook 'eshell-mode-hook
          #'(lambda ()
              (bind-key "C-c C-l" #'mu-counsel-esh-history
                        eshell-mode-map)))
 #+END_SRC

** tramp

#+BEGIN_SRC emacs-lisp
(setq tramp-default-method "ssh")
#+END_SRC

** ansible

#+BEGIN_SRC emacs-lisp
(use-package ansible
  :init
  (add-hook 'yaml-mode-hook '(lambda () (ansible 1))))

(use-package ansible-doc
  :after ansible
  :init
  (add-hook 'yaml-mode-hook #'ansible-doc-mode))
#+END_SRC

** docker

#+begin_src emacs-lisp
(use-package dockerfile-mode)

(use-package docker-compose-mode)

(use-package docker-tramp)
#+end_src

** puppet

#+BEGIN_SRC emacs-lisp
(use-package puppet-mode)
#+END_SRC

** vagrant

#+BEGIN_SRC emacs-lisp
(use-package vagrant)

(use-package vagrant-tramp
  :after vagrant
  :config
  (eval-after-load 'tramp '(vagrant-tramp-add-method)))
#+END_SRC

** ztree

#+BEGIN_SRC emacs-lisp
(use-package ztree)
#+END_SRC

* Tools
** dired - Directory Editing and Navigation

The best file-manager you can find ;). The keybinding below are to be used
inside a dired buffer.

Good dired tips can be found on [[http://ergoemacs.org/emacs/emacs_dired_tips.html][Xah Lee's blog]].

*** Keybindings

| *Key*     | *Command*                              | *Description*                                   |
|---------+--------------------------------------+-----------------------------------------------|
| ~^~       | =dired-up-directory=                   | go to parent directory                        |
| ~n~       | =dired-next-line=                      | go next line                                  |
| ~p~       | =dired-previous-line=                  | go prevous line                               |
| ~m~       | =dired-mark=                           | mark files/dir                                |
| ~u~       | =dired-unmark=                         | unmark files/dir                              |
| ~U~       | =dired-unmark-all-marks=               | unmark all marked                             |
| ~% m~     | =dired-mark-files-regexp=              | mark by pattern (regex)                       |
| ~!~       | =dired-do-shell-command=               | run shell command                             |
| ~&~       | =dired-do-async-shell-command=         | run shell commands asynchronously             |
| ~C~       | =dired-do-copy=                        | Copy file                                     |
| ~R~       | =dired-do-rename=                      | Rename/move file                              |
| ~D~       | =dired-do-delete=                      | Delete file or directory                      |
| ~c~       | =dired-do-compress-to=                 | compress marked files/dir. Details in [[http://oremacs.com/2015/10/23/dired-compress/][oremacs]] |
| ~Z~       | =dired-do-compress=                    | compress/decompress marked files              |
| ~z~       | =diredp-compress-this-file=            | compress/decompress file on cursor line       |
| ~/~       | =dired-narrow=                         | filter files                                  |
| ~a~       | =dired-find-alternate-file=            | open directory in the current buffer          |
| ~o~       | =dired-find-file-other-windows=        | open file on another window                   |
| ~F~       | =dired-do-find-marked-files=           | open all marked files                         |
| ~*.~      | =diredp-mark/unmark-extension=         | mark files by extension                       |
| ~+~       | =dired-create-directory=               | create a new directory                        |
| ~P~       | =peep-dired=                           | preview file at point                         |
| ~S~       | =dired-quick-sort=                     | sort files by name, type, size                |
| ~_~       | =xah-dired-rename-space-to-underscore= | rename file from space to underscore          |
| ~-~       | =xah-dired-rename-space-to-hyphen=     | rename file from space to hyphen              |
| ~g~       | =revert-buffer=                        | refresh dir listing                           |
| ~C-x C-p~ | =dired-toggle-read-only=               | make dired buffer writable                    |
| ~C-c C-c~ |                                      | apply the modifications on writable buffer    |
| ~C-c ESC~ |                                      | discard the modifications                     |
| ~C-u s~   | =dired-sort-toggle-or-edit=            | change `ls` switches on the fly               |

