init.el

;; [[file:~/.emacs.d/readme.org::*rust][rust:1]]
(use-package rust-mode
  :mode "\\.rs\\'"
  :init
  (setq rust-format-on-save t))

(use-package lsp-rust
  :after lsp-mode)
;; rust:1 ends here

;; [[file:~/.emacs.d/readme.org::*sql][sql:1]]
;; Make SQLi default to PostgreSQL syntax highlighti
;; https://blogs.gentoo.org/titanofold/2011/05/17/postgresql-syntax-highlighting-in-emacs/
(eval-after-load "sql"
  '(progn (sql-set-product 'postgres)))

;; Set default config for login
;; https://truongtx.me/2014/08/23/setup-emacs-as-an-sql-database-client/
(setq sql-postgres-login-params
      '((user :default "postgres")
        (database :default "postgres")
        (server)))

;; Truncate lines to better visualize many columns tables
;; Automatically renames the *SQL* buffer to *SQL user/database*
(add-hook 'sql-interactive-mode-hook
          (lambda ()
            (toggle-truncate-lines t)
            (sql-rename-buffer)))

(use-package sqlup-mode
  :bind (("C-c u" . sqlup-capitalize-keywords-in-region))
  :config
  (add-hook 'sql-mode-hook 'sqlup-mode)                ; capitalize keywords in SQL mode
  (add-hook 'sql-interactive-mode-hook 'sqlup-mode))   ; and in an interactive session (e.g. psql)

(use-package sql-indent
  :config
  (add-hook 'sql-mode-hook 'sqlind-minor-mode))
;; sql:1 ends here

;; [[file:~/.emacs.d/readme.org::*eshell][eshell:1]]
(setenv "LANG" "en_US.UTF-8")
(setenv "PAGER" "cat")
(setq eshell-scroll-to-bottom-on-input t)

;; Define a keybinding to get to your eshell quickly.
(global-set-key (kbd "C-c e") 'eshell)

;; Visual commands are commands which require a proper terminal.
;; eshell will run them in a term buffer when you invoke them.
(setq eshell-visual-commands
      '("less" "tmux" "htop" "top" "bash" "zsh" "fish"))
(setq eshell-visual-subcommands
      '(("git" "log" "l" "diff" "show")))

(setq eshell-cmpl-cycle-completions t)  ;TAB for suggestion

(add-hook 'eshell-mode-hook
          (lambda ()
            (setq-local show-trailing-whitespace nil)
            (semantic-mode -1)
            (hl-line-mode -1)
            (global-hl-line-mode -1)))

;; Define a pretty prompt.
(use-package eshell-git-prompt
  :config
  (eshell-git-prompt-use-theme 'powerline))

(add-hook 'eshell-mode-hook
          (lambda ()
            (define-key eshell-mode-map
              (kbd "<tab>") 'completion-at-point)))


;; Like Plan-9 shell
(use-package em-smart
  :ensure nil
  :init
  (add-hook 'eshell-mode-hook 'eshell-smart-initialize)
  :config
  (setq eshell-where-to-jump 'begin
        eshell-review-quick-commands nil
        eshell-smart-space-goes-to-end t))

(use-package eshell-bookmark
  :hook (eshell-mode . eshell-bookmark-setup))
;; eshell:1 ends here

;; [[file:~/.emacs.d/readme.org::*better-shell][better-shell:1]]
(use-package better-shell
  :bind (("C-'" . better-shell-shell)
         ("C-;" . better-shell-remote-open)))
;; better-shell:1 ends here

;; [[file:~/.emacs.d/readme.org::*eshell%20history%20with%20counsel][eshell history with counsel:1]]
(defun mu-counsel-esh-history ()
  "Browse Eshell history."
  (interactive)
  (setq ivy-completion-beg (point))
  (setq ivy-completion-end (point))
  (ivy-read "Symbol name: "
            (delete-dups
             (ring-elements eshell-history-ring))
            :action #'ivy-completion-in-region-action))

(add-hook 'eshell-mode-hook
          #'(lambda ()
              (bind-key "C-c C-l" #'mu-counsel-esh-history
                        eshell-mode-map)))
;; eshell history with counsel:1 ends here

;; [[file:~/.emacs.d/readme.org::*tramp][tramp:1]]
(setq tramp-default-method "ssh")
;; tramp:1 ends here

;; [[file:~/.emacs.d/readme.org::*ansible][ansible:1]]
(use-package ansible
  :init
  (add-hook 'yaml-mode-hook '(lambda () (ansible 1))))

(use-package ansible-doc
  :after ansible
  :init
  (add-hook 'yaml-mode-hook #'ansible-doc-mode))
;; ansible:1 ends here

;; [[file:~/.emacs.d/readme.org::*docker][docker:1]]
(use-package dockerfile-mode)

(use-package docker-compose-mode)

(use-package docker-tramp)
;; docker:1 ends here

;; [[file:~/.emacs.d/readme.org::*puppet][puppet:1]]
(use-package puppet-mode)
;; puppet:1 ends here

;; [[file:~/.emacs.d/readme.org::*vagrant][vagrant:1]]
(use-package vagrant)

(use-package vagrant-tramp
  :after vagrant
  :config
  (eval-after-load 'tramp '(vagrant-tramp-add-method)))
;; vagrant:1 ends here

;; [[file:~/.emacs.d/readme.org::*ztree][ztree:1]]
(use-package ztree)
;; ztree:1 ends here

;; [[file:~/.emacs.d/readme.org::*Main%20configuration][Main configuration:1]]
(use-package dired
  :ensure nil
  :config
  (validate-setq
