readme.org
*** Main configuration

#+BEGIN_SRC emacs-lisp
(use-package dired
  :ensure nil
  :config
  (validate-setq
   ;;ls-lisp-dirs-first t
   ;; this is only for macOS - FIXME
   insert-directory-program "gls"
   dired-use-ls-dired t
   dired-listing-switches
   "-lhFG1v --group-directories-first"  ; add ls switches

   dired-ls-F-marks-symlinks t           ; -F marks links with @
   dired-dwim-target t                   ; when in a split windows, use other pane as target
   dired-recursive-copies 'always        ; copy dirs recursively
   dired-recursive-deletes 'top          ; ask before deleting dirs recursively
   delete-by-moving-to-trash t           ; don't delete files outright
   dired-auto-revert-buffer t            ; revert buffers on revisiting
   )

  (setq wdired-allow-to-change-permissions t)  ; allow editing file permissions

  (add-hook 'dired-mode-hook #'toggle-truncate-lines)   ; handle long file names
  (add-hook 'dired-mode-hook 'auto-revert-mode)         ; auto refresh dired when file changes
  )

;; Built into Emacs, it provides chgrp, chown, chmod and other functionalities
(use-package dired-aux
  :ensure nil)
#+END_SRC

*** dired-x

#+BEGIN_SRC emacs-lisp
(use-package dired-x
  :ensure nil
  :bind ("C-x C-j" . dired-jump)
  :config
  (validate-setq
   dired-clean-up-buffers-too t)          ; kill buffer of files/dir that are deleted in dired

  (add-hook 'dired-mode-hook (lambda () (dired-omit-mode)))
  (add-to-list 'dired-omit-extensions ".DS_Store"))
#+END_SRC

*** dired-plus

At some point Melpa has stopped indexing the code present on the Emacs wiki, so ~dired+~ and
a bunch of other packages got lost. It seems that most are being restored somewhere but
that hasn't been the case for ~dired+~ yet.

Of course, I could just copy the [[https://www.emacswiki.org/emacs/dired%2b.el][dired+.el]] file in my local path, but I will wait for now
until it appears somewhere, so I'm leaving it out of the tangling process.

[[https://github.com/zamansky/using-emacs/issues/4][source]]

#+BEGIN_SRC emacs-lisp :tangle no
(use-package dired+
  :ensure nil
  :config
  (validate-setq
   diredp-hide-details-initially-flag t
   diredp-hide-details-propagate-flag t)

  (diredp-toggle-find-file-reuse-dir 1)        ; use single buffer for all dired navigation
  (diredp-make-find-file-keys-reuse-dirs)

  ;; assign h and l to be used on dired mode (evil keys)
  ;; (eval-after-load 'dired
  ;;   '(evil-define-key 'normal dired-mode-map
  ;;      (kbd "h") 'diredp-up-directory-reuse-dir-buffer
  ;;      (kbd "l") 'diredp-find-file-reuse-dir-buffer))

  (customize-set-variable 'diredp-hide-details-initially-flag nil) ; keep showing info
  )
#+END_SRC

*** dired-async

Use async in everything in dired.

#+BEGIN_SRC emacs-lisp
(use-package dired-async
  :ensure nil
  :after async
  :config
  (dired-async-mode t)
  (autoload 'dired-async-mode "dired-async.el" nil t))
#+END_SRC

*** dired-quick-sort

[[https://gitlab.com/xuhdev/dired-quick-sort][dired-quick-sort]] provides persistent quick sorting of Dired buffers in various
ways with hydra.

#+BEGIN_SRC emacs-lisp
(use-package dired-quick-sort
  :config
  (dired-quick-sort-setup))
#+END_SRC

*** dired-hacks

[[https://github.com/Fuco1/dired-hacks][dired-hacks]] is a collection of useful dired additions.

**** dired-narrow

Dired narrowing allows filtering dired results dynamically with a filter. Very
cool.

#+BEGIN_SRC emacs-lisp
(use-package dired-narrow
  :bind (:map dired-mode-map
              ("/" . dired-narrow)))
#+END_SRC

**** dired-rainbow

#+BEGIN_SRC emacs-lisp
(use-package dired-rainbow)
#+END_SRC

*** peep-dired

[[https://github.com/asok/peep-dired][peep-dired]] is a convienent way to look up file contents in other window while
browsing directory in dired.

#+BEGIN_SRC emacs-lisp
(use-package peep-dired
  :bind (:map dired-mode-map
              ("P" . peep-dired))
  :config
  (validate-setq peep-dired-ignored-extensions '("mkv" "iso" "mp4")))
#+END_SRC

*** Icons in Dired buffers (and other buffers)

#+BEGIN_SRC emacs-lisp
(use-package all-the-icons-dired
  :after all-the-icons
  :init
  (add-hook 'dired-mode-hook 'all-the-icons-dired-mode))
#+END_SRC

*** Rename file from space to hyphen/underscore

Here's a command that rename files by replacing space to underscore _ or hyphen -.

In dired, just press a key, then the file under cursor (or marked files) will be
renamed with all space replaced to underscore.

#+BEGIN_SRC emacs-lisp
(defun xah-dired-rename-space-to-underscore ()
  "In dired, rename current or marked files by replacing space to underscore _.
If not in `dired', do nothing.
URL `http://ergoemacs.org/emacs/elisp_dired_rename_space_to_underscore.html'
Version 2017-01-02"
  (interactive)
  (require 'dired-aux)
  (if (equal major-mode 'dired-mode)
      (progn
        (mapc (lambda (x)
                (when (string-match " " x )
                  (dired-rename-file x (replace-regexp-in-string " " "_" x) nil)))
              (dired-get-marked-files ))
        (revert-buffer))
    (user-error "Not in dired.")))

(defun xah-dired-rename-space-to-hyphen ()
  "In dired, rename current or marked files by replacing space to hyphen -.
If not in `dired', do nothing.
URL `http://ergoemacs.org/emacs/elisp_dired_rename_space_to_underscore.html'
Version 2016-12-22"
  (interactive)
  (require 'dired-aux)
  (if (equal major-mode 'dired-mode)
      (progn
        (mapc (lambda (x)
                (when (string-match " " x )
                  (dired-rename-file x (replace-regexp-in-string " " "_" x) nil)))
              (dired-get-marked-files ))
        (revert-buffer))
    (user-error "Not in dired")))
#+END_SRC

*** Calculate size of directory

The title says it all. It is originally from the [[https://www.emacswiki.org/emacs/DiredGetFileSize][Wiki]] but I found it [[https://oremacs.com/2015/01/12/dired-file-size/][here]].

#+BEGIN_SRC emacs-lisp
(defun dired-get-size ()
  (interactive)
  (let ((files (dired-get-marked-files)))
    (with-temp-buffer
      (apply 'call-process "/usr/bin/du" nil t nil "-sch" files)
      (message
       "Size of all marked files: %s"
       (progn
         (re-search-backward "\\(^[ 0-9.,]+[A-Za-z]+\\).*total$")
         (match-string 1))))))
#+END_SRC

** define-word

Display the definition of word at point in Emacs. Another nice package from [[https://github.com/abo-abo/define-word][from abo-abo]].
It leverages the [[https://www.wordnik.com/][Wordnik]] dictionary site to get its definitions, so you have to be online.

#+BEGIN_SRC emacs-lisp
(use-package define-word)
#+END_SRC

** powerthesaurus

[[https://github.com/SavchenkoValeriy/emacs-powerthesaurus][emacs-powerthesaurus]] is a simple plugin to integrate Emacs with amazing[[https://www.powerthesaurus.org/][ powerthesaurus.org]].

#+BEGIN_SRC emacs-lisp
(use-package powerthesaurus)
#+END_SRC

