init.el
   ;;ls-lisp-dirs-first t
   ;; this is only for macOS - FIXME
   insert-directory-program "gls"
   dired-use-ls-dired t
   dired-listing-switches
   "-lhFG1v --group-directories-first"  ; add ls switches

   dired-ls-F-marks-symlinks t           ; -F marks links with @
   dired-dwim-target t                   ; when in a split windows, use other pane as target
   dired-recursive-copies 'always        ; copy dirs recursively
   dired-recursive-deletes 'top          ; ask before deleting dirs recursively
   delete-by-moving-to-trash t           ; don't delete files outright
   dired-auto-revert-buffer t            ; revert buffers on revisiting
   )

  (setq wdired-allow-to-change-permissions t)  ; allow editing file permissions

  (add-hook 'dired-mode-hook #'toggle-truncate-lines)   ; handle long file names
  (add-hook 'dired-mode-hook 'auto-revert-mode)         ; auto refresh dired when file changes
  )

;; Built into Emacs, it provides chgrp, chown, chmod and other functionalities
(use-package dired-aux
  :ensure nil)
;; Main configuration:1 ends here

;; [[file:~/.emacs.d/readme.org::*dired-x][dired-x:1]]
(use-package dired-x
  :ensure nil
  :bind ("C-x C-j" . dired-jump)
  :config
  (validate-setq
   dired-clean-up-buffers-too t)          ; kill buffer of files/dir that are deleted in dired

  (add-hook 'dired-mode-hook (lambda () (dired-omit-mode)))
  (add-to-list 'dired-omit-extensions ".DS_Store"))
;; dired-x:1 ends here

;; [[file:~/.emacs.d/readme.org::*dired-async][dired-async:1]]
(use-package dired-async
  :ensure nil
  :after async
  :config
  (dired-async-mode t)
  (autoload 'dired-async-mode "dired-async.el" nil t))
;; dired-async:1 ends here

;; [[file:~/.emacs.d/readme.org::*dired-quick-sort][dired-quick-sort:1]]
(use-package dired-quick-sort
  :config
  (dired-quick-sort-setup))
;; dired-quick-sort:1 ends here

;; [[file:~/.emacs.d/readme.org::*dired-narrow][dired-narrow:1]]
(use-package dired-narrow
  :bind (:map dired-mode-map
              ("/" . dired-narrow)))
;; dired-narrow:1 ends here

;; [[file:~/.emacs.d/readme.org::*dired-rainbow][dired-rainbow:1]]
(use-package dired-rainbow)
;; dired-rainbow:1 ends here

;; [[file:~/.emacs.d/readme.org::*peep-dired][peep-dired:1]]
(use-package peep-dired
  :bind (:map dired-mode-map
              ("P" . peep-dired))
  :config
  (validate-setq peep-dired-ignored-extensions '("mkv" "iso" "mp4")))
;; peep-dired:1 ends here

;; [[file:~/.emacs.d/readme.org::*Icons%20in%20Dired%20buffers%20(and%20other%20buffers)][Icons in Dired buffers (and other buffers):1]]
(use-package all-the-icons-dired
  :after all-the-icons
  :init
  (add-hook 'dired-mode-hook 'all-the-icons-dired-mode))
;; Icons in Dired buffers (and other buffers):1 ends here

;; [[file:~/.emacs.d/readme.org::*Rename%20file%20from%20space%20to%20hyphen/underscore][Rename file from space to hyphen/underscore:1]]
(defun xah-dired-rename-space-to-underscore ()
  "In dired, rename current or marked files by replacing space to underscore _.
If not in `dired', do nothing.
URL `http://ergoemacs.org/emacs/elisp_dired_rename_space_to_underscore.html'
Version 2017-01-02"
  (interactive)
  (require 'dired-aux)
  (if (equal major-mode 'dired-mode)
      (progn
        (mapc (lambda (x)
                (when (string-match " " x )
                  (dired-rename-file x (replace-regexp-in-string " " "_" x) nil)))
              (dired-get-marked-files ))
        (revert-buffer))
    (user-error "Not in dired.")))

(defun xah-dired-rename-space-to-hyphen ()
  "In dired, rename current or marked files by replacing space to hyphen -.
If not in `dired', do nothing.
URL `http://ergoemacs.org/emacs/elisp_dired_rename_space_to_underscore.html'
Version 2016-12-22"
  (interactive)
  (require 'dired-aux)
  (if (equal major-mode 'dired-mode)
      (progn
        (mapc (lambda (x)
                (when (string-match " " x )
                  (dired-rename-file x (replace-regexp-in-string " " "_" x) nil)))
              (dired-get-marked-files ))
        (revert-buffer))
    (user-error "Not in dired")))
;; Rename file from space to hyphen/underscore:1 ends here

;; [[file:~/.emacs.d/readme.org::*Calculate%20size%20of%20directory][Calculate size of directory:1]]
(defun dired-get-size ()
  (interactive)
  (let ((files (dired-get-marked-files)))
    (with-temp-buffer
      (apply 'call-process "/usr/bin/du" nil t nil "-sch" files)
      (message
       "Size of all marked files: %s"
       (progn
         (re-search-backward "\\(^[ 0-9.,]+[A-Za-z]+\\).*total$")
         (match-string 1))))))
;; Calculate size of directory:1 ends here

;; [[file:~/.emacs.d/readme.org::*define-word][define-word:1]]
(use-package define-word)
;; define-word:1 ends here

;; [[file:~/.emacs.d/readme.org::*powerthesaurus][powerthesaurus:1]]
(use-package powerthesaurus)
;; powerthesaurus:1 ends here

;; [[file:~/.emacs.d/readme.org::*IRC%20(Internet%20Relay%20Chat)][IRC (Internet Relay Chat):1]]
(use-package erc
  :config
  (progn
