readme.org
** IRC (Internet Relay Chat)
IRC is a great way to hang out with other Emacs geeks. I use ERC for that and
the configuration here is adapted from [[https://github.com/bbatsov/prelude/blob/master/modules/prelude-erc.el][Prelude]].

#+BEGIN_SRC emacs-lisp
(use-package erc
  :config
  (progn
    (erc-track-mode t)                      ; track activities on chats
    (erc-truncate-mode +1)                  ; truncate long irc buffers
    (erc-spelling-mode 1)                   ; enable spell checking

    (setq erc-interpret-mirc-color t        ; interpret mIRC-style color commands in IRC chats
          erc-kill-buffer-on-part t         ; kill buffer for channels after /part
          erc-kill-queries-on-quit t        ; kill buffer for private queries after quitting the server
          erc-kill-server-buffer-on-quit t  ; kill buffer for server messages after quitting the server
          erc-query-display 'buffer         ; open query buffers in the current window
          erc-save-buffer-on-part t         ; logging

          ;; autoaway setup
          erc-auto-discard-away t
          erc-autoaway-idle-seconds 600
          erc-autoaway-use-emacs-idle t

          erc-server-coding-system '(utf-8 . utf-8) ; utf-8 always and forever

          erc-track-exclude-types '("JOIN" "NICK" "PART" "QUIT" "MODE"
                                    "324" "329" "332" "333" "353" "477") ; exclude these from tracking
          erc-hide-list '("JOIN" "PART" "QUIT" "NICK")  ; doesn't show any of these
          )

  ;; logging
  ;; (setq erc-log-channels-directory "~/.erc/logs/")

  ;; (if (not (file-exists-p erc-log-channels-directory))
  ;;     (mkdir erc-log-channels-directory t))

  (defvar erc-notify-nick-alist nil
    "Alist of nicks and the last time they tried to trigger a
  notification")

  (defvar erc-notify-timeout 10
    "Number of seconds that must elapse between notifications from
  the same person.")

  (defun erc-notify-allowed-p (nick &optional delay)
    "Return non-nil if a notification should be made for NICK.
  If DELAY is specified, it will be the minimum time in seconds
  that can occur between two notifications.  The default is
  `erc-notify-timeout'."
    (unless delay (setq delay erc-notify-timeout))
    (let ((cur-time (time-to-seconds (current-time)))
          (cur-assoc (assoc nick erc-notify-nick-alist))
          (last-time nil))
      (if cur-assoc
          (progn
            (setq last-time (cdr cur-assoc))
            (setcdr cur-assoc cur-time)
            (> (abs (- cur-time last-time)) delay))
        (push (cons nick cur-time) erc-notify-nick-alist)
        t)))

  (defun start-irc ()
    "Connect to IRC."
    (interactive)
    (when (y-or-n-p "Do you want to start IRC? ")
      (erc :server "irc.freenode.net"
           :port 6667
           :nick rubens)))

  ;; (defun erc-start-or-switch ()
  ;;   "Connect to ERC, or switch to last active buffer"
  ;;   (interactive)
  ;;   (if (get-buffer "irc.freenode.net:6667")  ; ERC already active?
  ;;       (erc-track-switch-buffer 1)           ; yes: switch to last active

  ;;     (when (y-or-n-p "Start ERC? ")          ; no: maybe start ERC
  ;;       (erc :server "irc.freenode.net"
  ;;            :port 6667
  ;;            :nick "rsouza"))))

  (defun filter-server-buffers ()
    (delq nil
          (mapcar
           (lambda (x) (and (erc-server-buffer-p x) x))
           (buffer-list))))

  (defun stop-irc ()
    "Disconnects from all irc servers"
    (interactive)
    (dolist (buffer (filter-server-buffers))
      (message "Server buffer: %s" (buffer-name buffer))
      (with-current-buffer buffer
        (erc-quit-server "Asta la vista"))))

  (setq erc-autojoin-channels-alist '(("freenode.net"
                                       "#org-mode"
                                       "#hacklabto"
                                       "#emacs"
                                       "#itpug-soci")))

  (require 'erc-log)
  (require 'erc-notify)
  (require 'erc-spelling)
  (require 'erc-autoaway)
  ))
#+END_SRC

** Spell and grammar checking


Emacs can help you writing better...I know, I know, this is relative, but the
tools here will try to help you with the language, at least ;)

Reading these articles will better explain the idea: [[https://joelkuiper.eu/spellcheck_emacs][Joel Kuiper's spellcheck emacs]]
and [[http://matt.might.net/articles/shell-scripts-for-passive-voice-weasel-words-duplicates/][Matt Might's weasel words]].

*** flyspell

It activates Spell Checking by default. Also uses hunspell instead of ispell as
corrector.

| *Key binding*                | *Command* | *Result*                        |
|----------------------------+---------+-------------------------------|
| flyspell-popup-correct     | =C-;=     | spell-check the word on point |
| flyspell-goto-next-error   | =C-,=     | got to the next error         |
| flyspell-auto-correct-word | =C-M-i=   | auto-correct the word         |
| flyspell-buffer            | =S s b=   | check the whole buffer        |
| flyspell-lazy-check-buffer | =S s z=   | check the whole buffer faster |
| switch-dictionary          | =S s d=   | switch dictionaries (GB-IT)   |

**** hunspell setup

1. Install Hunspell from your distribution package manager or use [[http://hunspell.sourceforge.net/][Hunspell page]]
2. Download the language dictionary extension from [[http://extensions.libreoffice.org/extension-center][Libreoffice]] or  [[http://extensions.openoffice.org/en/project/english-dictionaries-apache-openoffice][Openoffice]]
3. It will download the file ~<language>.oxt~. Rename it to ~<language>.zip~ and unzip
   it into a temporary folder.
4. Copy the ~<language>.dic~ and ~<language>.aff~ files from there to a folder where you save
   dictionary files, usually to =~/usr/local/share/hunspell/= or =~/usr/share/hunspell/=
5. Add that path to shell env variable ~DICPATH~: =setenv DICPATH $MYLOCAL/share/hunspell=
6. Restart emacs so that when hunspell is run by ispell/flyspell, that env variable is effective.

Hunspell will search for a dictionary called ~en_GB~ in the path specified by =$DICPATH=.

#+BEGIN_SRC emacs-lisp
(use-package ispell
  :if
  (and (eq system-type 'darwin)
       (setenv "DICPATH" "/Users/rubens/Library/Spelling")
       (setenv "DICTIONARY" "en_GB")
       (setenv "LANG" "en_GB"))
  :config
  (setq ispell-dictionary "en_GB")
  (setq ispell-program-name (executable-find "hunspell"))
  (setq ispell-extra-args '("-i" "utf-8"))
  (setq ispell-really-hunspell t)
  (setq ispell-check-comments  t)

  (unless ispell-program-name
    (warn "No spell checker available. Please install hunspell.")))

(use-package flyspell
  :defer t
  :hook ((prog-mode     . flyspell-prog-mode)
         (text-mode     . flyspell-mode)
         (org-mode      . flyspell-mode)
         (markdown-mode . flyspell-mode)
         (LaTeX-mode    . flyspell-mode))
  :config
  (progn
    (setq ispell-local-dictionary-alist '(("en_GB"
                                           "[[:alpha:]]"
                                           "[^[:alpha:]]"
                                           "[']" nil
                                           ("-d" "en_GB") nil utf-8)
                                          ("it_IT"
                                           "[[:alpha:]]"
                                           "[^[:alpha:]]"
                                           "[']" nil
                                           ("-d" "it_IT") nil utf-8)
                                          )))

  (setq flyspell-issue-welcome-flag nil  ; turn off flyspell welcome message
        flyspell-issue-message-flag nil) ; turn off flyspell messages when checking words
)

(use-package flyspell-correct-ivy       ; better interface for corrections
  :demand t
  :bind (:map flyspell-mode-map
              ("C-c $" . flyspell-correct-at-point)))
#+END_SRC

**** Switch dictionaries

Switch between the most used dictionaries in my case.

#+BEGIN_SRC emacs-lisp
(defun switch-dictionary ()
  (interactive)
  (let* ((dic ispell-current-dictionary)
         (change (if (string= dic "en_GB") "it_IT" "en_GB")))
    (ispell-change-dictionary change)
    (message "Dictionary switched from %s to %s" dic change)))

(global-set-key (kbd "<f8>") 'switch-dictionary)
#+END_SRC

**** flyspell-lazy

Flyspell usually slows down the responsiveness when writing texts. [[https://github.com/rolandwalker/flyspell-lazy][flyspell-lazy]]
is used to improve *Flyspell* responsiveness using idle timers.

#+BEGIN_SRC emacs-lisp
(use-package flyspell-lazy
  :after flyspell
  :config
  (flyspell-lazy-mode 1))
#+END_SRC

**** flyspell-popup

[[https://github.com/xuchunyang/flyspell-popup][Flyspell-popup]] is used to correct words with Flyspell in popup menus.

#+BEGIN_SRC emacs-lisp
(use-package flyspell-popup
  :after flyspell
  :bind (:map flyspell-mode-map
              ("C-;" . flyspell-popup-correct)))
#+END_SRC

