init.el
    (erc-track-mode t)                      ; track activities on chats
    (erc-truncate-mode +1)                  ; truncate long irc buffers
    (erc-spelling-mode 1)                   ; enable spell checking

    (setq erc-interpret-mirc-color t        ; interpret mIRC-style color commands in IRC chats
          erc-kill-buffer-on-part t         ; kill buffer for channels after /part
          erc-kill-queries-on-quit t        ; kill buffer for private queries after quitting the server
          erc-kill-server-buffer-on-quit t  ; kill buffer for server messages after quitting the server
          erc-query-display 'buffer         ; open query buffers in the current window
          erc-save-buffer-on-part t         ; logging

          ;; autoaway setup
          erc-auto-discard-away t
          erc-autoaway-idle-seconds 600
          erc-autoaway-use-emacs-idle t

          erc-server-coding-system '(utf-8 . utf-8) ; utf-8 always and forever

          erc-track-exclude-types '("JOIN" "NICK" "PART" "QUIT" "MODE"
                                    "324" "329" "332" "333" "353" "477") ; exclude these from tracking
          erc-hide-list '("JOIN" "PART" "QUIT" "NICK")  ; doesn't show any of these
          )

  ;; logging
  ;; (setq erc-log-channels-directory "~/.erc/logs/")

  ;; (if (not (file-exists-p erc-log-channels-directory))
  ;;     (mkdir erc-log-channels-directory t))

  (defvar erc-notify-nick-alist nil
    "Alist of nicks and the last time they tried to trigger a
  notification")

  (defvar erc-notify-timeout 10
    "Number of seconds that must elapse between notifications from
  the same person.")

  (defun erc-notify-allowed-p (nick &optional delay)
    "Return non-nil if a notification should be made for NICK.
  If DELAY is specified, it will be the minimum time in seconds
  that can occur between two notifications.  The default is
  `erc-notify-timeout'."
    (unless delay (setq delay erc-notify-timeout))
    (let ((cur-time (time-to-seconds (current-time)))
          (cur-assoc (assoc nick erc-notify-nick-alist))
          (last-time nil))
      (if cur-assoc
          (progn
            (setq last-time (cdr cur-assoc))
            (setcdr cur-assoc cur-time)
            (> (abs (- cur-time last-time)) delay))
        (push (cons nick cur-time) erc-notify-nick-alist)
        t)))

  (defun start-irc ()
    "Connect to IRC."
    (interactive)
    (when (y-or-n-p "Do you want to start IRC? ")
      (erc :server "irc.freenode.net"
           :port 6667
           :nick rubens)))

  ;; (defun erc-start-or-switch ()
  ;;   "Connect to ERC, or switch to last active buffer"
  ;;   (interactive)
  ;;   (if (get-buffer "irc.freenode.net:6667")  ; ERC already active?
  ;;       (erc-track-switch-buffer 1)           ; yes: switch to last active

  ;;     (when (y-or-n-p "Start ERC? ")          ; no: maybe start ERC
  ;;       (erc :server "irc.freenode.net"
  ;;            :port 6667
  ;;            :nick "rsouza"))))

  (defun filter-server-buffers ()
    (delq nil
          (mapcar
           (lambda (x) (and (erc-server-buffer-p x) x))
           (buffer-list))))

  (defun stop-irc ()
    "Disconnects from all irc servers"
    (interactive)
    (dolist (buffer (filter-server-buffers))
      (message "Server buffer: %s" (buffer-name buffer))
      (with-current-buffer buffer
        (erc-quit-server "Asta la vista"))))

  (setq erc-autojoin-channels-alist '(("freenode.net"
                                       "#org-mode"
                                       "#hacklabto"
                                       "#emacs"
                                       "#itpug-soci")))

  (require 'erc-log)
  (require 'erc-notify)
  (require 'erc-spelling)
  (require 'erc-autoaway)
  ))
;; IRC (Internet Relay Chat):1 ends here

;; [[file:~/.emacs.d/readme.org::*hunspell%20setup][hunspell setup:1]]
(use-package ispell
  :if
  (and (eq system-type 'darwin)
       (setenv "DICPATH" "/Users/rubens/Library/Spelling")
       (setenv "DICTIONARY" "en_GB")
       (setenv "LANG" "en_GB"))
  :config
  (setq ispell-dictionary "en_GB")
  (setq ispell-program-name (executable-find "hunspell"))
  (setq ispell-extra-args '("-i" "utf-8"))
  (setq ispell-really-hunspell t)
  (setq ispell-check-comments  t)

  (unless ispell-program-name
    (warn "No spell checker available. Please install hunspell.")))

(use-package flyspell
  :defer t
  :hook ((prog-mode     . flyspell-prog-mode)
         (text-mode     . flyspell-mode)
         (org-mode      . flyspell-mode)
         (markdown-mode . flyspell-mode)
         (LaTeX-mode    . flyspell-mode))
  :config
  (progn
    (setq ispell-local-dictionary-alist '(("en_GB"
                                           "[[:alpha:]]"
                                           "[^[:alpha:]]"
                                           "[']" nil
                                           ("-d" "en_GB") nil utf-8)
                                          ("it_IT"
                                           "[[:alpha:]]"
                                           "[^[:alpha:]]"
                                           "[']" nil
                                           ("-d" "it_IT") nil utf-8)
                                          )))

  (setq flyspell-issue-welcome-flag nil  ; turn off flyspell welcome message
        flyspell-issue-message-flag nil) ; turn off flyspell messages when checking words
)

(use-package flyspell-correct-ivy       ; better interface for corrections
  :demand t
  :bind (:map flyspell-mode-map
              ("C-c $" . flyspell-correct-at-point)))
;; hunspell setup:1 ends here

;; [[file:~/.emacs.d/readme.org::*Switch%20dictionaries][Switch dictionaries:1]]
(defun switch-dictionary ()
  (interactive)
  (let* ((dic ispell-current-dictionary)
         (change (if (string= dic "en_GB") "it_IT" "en_GB")))
    (ispell-change-dictionary change)
    (message "Dictionary switched from %s to %s" dic change)))

(global-set-key (kbd "<f8>") 'switch-dictionary)
;; Switch dictionaries:1 ends here

;; [[file:~/.emacs.d/readme.org::*flyspell-lazy][flyspell-lazy:1]]
(use-package flyspell-lazy
  :after flyspell
  :config
  (flyspell-lazy-mode 1))
;; flyspell-lazy:1 ends here

;; [[file:~/.emacs.d/readme.org::*flyspell-popup][flyspell-popup:1]]
(use-package flyspell-popup
  :after flyspell
  :bind (:map flyspell-mode-map
              ("C-;" . flyspell-popup-correct)))
;; flyspell-popup:1 ends here
