readme.org
*** main theme

Here is a list of some themes I like. Just enable it on the configuration below;
don't forget the disable the one that is active.

- [[https://github.com/jordonbiondo/ample-theme][ample-themes]]
- [[https://github.com/waymondo/apropospriate-theme][apropospriate-theme]]
- [[https://github.com/hlissner/emacs-doom-theme][doom-theme]]
- [[https://github.com/fniessen/emacs-leuven-theme][leuven-theme]]
- [[https://github.com/cpaulik/emacs-material-theme][material-theme]]
- [[https://github.com/oneKelvinSmith/monokai-emacs][monokai-theme]]
- [[https://github.com/purcell/color-theme-sanityinc-tomorrow][sanityinc-tomorrow]]
- [[https://github.com/bbatsov/solarized-emacs][solarized-theme]]
- [[https://github.com/nashamri/spacemacs-theme][spacemacs-theme]]
- [[https://github.com/bbatsov/zenburn-emacs][zenburn-theme]]
- [[https://gitlab.petton.fr/nico/zerodark-theme][zerodark-theme]]

Some themes, as solarized and material, change the pitch size of org-headers, leaving them
a little too big for someone's taste. Of course, as this is Emacs, they can be adjusted.
Check the changes required for the [[https://gist.github.com/rubensts/a0d8786a633bd2aa8eacd1ea9f52a694][material-theme]] and, also, for the [[https://github.com/bbatsov/solarized-emacs#theme-specific-settings][solarized-theme]].

#+BEGIN_SRC emacs-lisp
(use-package spacemacs-theme
  :disabled t
  :no-require t
  :init
  (load-theme 'spacemacs-light t))

(use-package doom-themes
  :init
  (setq doom-themes-enable-bold t     ; bold is universally enable
        doom-themes-enable-italic t)  ; italics is universally enabled
  (load-theme 'doom-one t)
  :config
  (doom-themes-visual-bell-config)  ; flashes mode-line on errors
  (doom-themes-org-config))         ; corrects (and improves) org-mode's native fontification

(use-package leuven-theme
  :disabled t
  :init
  (load-theme 'leuven t))

(use-package gruvbox-theme
  :disabled t
  :config
  (load-theme 'gruvbox-light-soft t))

(use-package poet-theme
  :disabled t
  :init
  (load-theme 'poet t)
  :config
  (add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
  (add-to-list 'default-frame-alist '(ns-appearance . light)))
 #+END_SRC

*** [[https://github.com/hlissner/emacs-solaire-mode][solaire-mode]]

#+BEGIN_QUOTE
solaire-mode is an aesthetic plugin that helps visually distinguish file-visiting windows
from other types of windows (like popups or sidebars) by giving them a slightly different
-- often brighter -- background.
#+END_QUOTE

#+BEGIN_SRC emacs-lisp
(use-package solaire-mode
  :hook (((after-change-major-mode after-revert) . turn-on-solaire-mode)
         (ediff-prepare-buffer . solaire-mode)
         (minibuffer-setup . solaire-mode-in-minibuffer))
  :config
  (solaire-mode-swap-bg)
  (advice-add #'persp-load-state-from-file
              :after #'solaire-mode-restore-persp-mode-buffers))
#+END_SRC

** Modeline

#+BEGIN_SRC emacs-lisp
;; (use-package spaceline)

;; (use-package spaceline-config
;;   :ensure nil
;;   :config
;;   (spaceline-spacemacs-theme))

(use-package spaceline
  :disabled t
  :config
  (progn
    (require 'spaceline-config)
    (spaceline-spacemacs-theme)
    (validate-setq powerline-default-separator 'wave)
    (spaceline-toggle-minor-modes-off)
    (spaceline-compile)
    ))

(use-package spaceline-all-the-icons
  :disabled t
  ;; :after spaceline
  :config
  (spaceline-all-the-icons-theme)
  (spaceline-all-the-icons--setup-anzu)      ; enable anzu searching
  (spaceline-all-the-icons--setup-git-ahead) ; enable # of commits ahead of upstream in git
  )

(use-package doom-modeline
  ;; :disabled t
  :hook (after-init . doom-modeline-init))
#+END_SRC

** Fonts
*** Font selection

There are many beautiful fonts that can be selected here. As I prefer to enjoy all the
power of Emacs GUI (we aren't in the 70's anymore, are we? ;)) I keep between ~Source Code
Pro~ and ~Fira Code~.

If you want to try using font ligatures, check [[https://github.com/tonsky/FiraCode/wiki/Setting-up-Emacs][here for Fira Code instructions]].

**** test 1

#+BEGIN_SRC emacs-lisp :tangle no
;; (let* ((variable-tuple
;;         (cond ((x-list-fonts "Source Sans Pro") '(:font "Source Sans Pro"))
;;               ((x-list-fonts "Lucida Grande")   '(:font "Lucida Grande"))
;;               ((x-list-fonts "Verdana")         '(:font "Verdana"))
;;               ((x-family-fonts "Sans Serif")    '(:family "Sans Serif"))
;;               (nil (warn "Cannot find a Sans Serif Font.  Install Source Sans Pro."))))
;;        (base-font-color     (face-foreground 'default nil 'default))
;;        (headline           `(:inherit default :weight bold :foreground ,base-font-color))
;;        )

;;   (custom-theme-set-faces
;;    'user
;;    `(org-level-8 ((t (,@headline ,@variable-tuple))))
;;    `(org-level-7 ((t (,@headline ,@variable-tuple))))
;;    `(org-level-6 ((t (,@headline ,@variable-tuple))))
;;    `(org-level-5 ((t (,@headline ,@variable-tuple))))
;;    `(org-level-4 ((t (,@headline ,@variable-tuple :height 1.0))))
;;    `(org-level-3 ((t (,@headline ,@variable-tuple :height 1.0))))
;;    `(org-level-2 ((t (,@headline ,@variable-tuple :height 1.1))))
;;    `(org-level-1 ((t (,@headline ,@variable-tuple :height 1.25))))
;;   `(org-document-title ((t (,@headline ,@variable-tuple :height 1.25 :underline nil))))))

(custom-theme-set-faces
 'user
 '(variable-pitch ((t (:family "Source Sans Pro"
                               :height 120
                               ;; :weight normal
                               ))))
 '(fixed-pitch ((t (:family "FuraCode Nerd Font"
                            ;;:slant normal
                            ;;:weight normal
                            :height 100
                            ;;:width normal
                            )))))

(add-hook 'org-mode-hook 'variable-pitch-mode)
(add-hook 'org-mode-hook 'visual-line-mode)

(custom-theme-set-faces
 'user
 '(org-block                 ((t (:inherit fixed-pitch))))
 ;;'(org-document-info         ((t (:foreground "dark orange"))))
 '(org-document-info-keyword ((t (:inherit (shadow fixed-pitch)))))
 ;;'(org-link                  ((t (:foreground "royal blue" :underline t))))
 '(org-meta-line             ((t (:inherit (font-lock-comment-face fixed-pitch)))))
 '(org-property-value        ((t (:inherit fixed-pitch))) t)
 '(org-special-keyword       ((t (:inherit (font-lock-comment-face fixed-pitch)))))
 '(org-tag                   ((t (:inherit (shadow fixed-pitch) :weight bold :height 0.8))))
 '(org-verbatim              ((t (:inherit (shadow fixed-pitch))))))

;; (custom-theme-set-variables
;;  gruvbox-light-medium
;;  '(line-spacing 0.1))
#+END_SRC

**** test 2

#+BEGIN_SRC emacs-lisp
(cond ((system-is-linux)
       (set-face-attribute 'default nil
                           ;;:family "Source Code Pro"
                           :family "SauceCodePro Nerd Font"
                           :height 90))
      ((system-is-mac)
       (set-face-attribute 'default nil
                           ;;:family "FuraCode Nerd Font"
                           :family "SauceCodePro Nerd Font"
                           :height 110)

       ;; Enable emoji, and stop the UI from freezing when trying to display them.
       ;;(if (fboundp 'set-fontset-font)
       ;;    (set-fontset-font t 'unicode "Apple Color Emoji" nil 'prepend))
       ))

;; Set a font with great support for Unicode Symbols to fallback in those case
;; where certain Unicode glyphs are missing in the current font.
;; Test range: 🐷 ❤ ⊄ ∫ 𝛼 α 🜚 Ⓚ
;;(set-fontset-font "fontset-default" nil
;;                 (font-spec :size 100 :name "SauceCodePro Nerd"))
#+END_SRC

**** test 3

#+BEGIN_SRC emacs-lisp :tangle no
(set-face-attribute 'default nil :family "FuraCode Nerd Font" :height 100)
(set-face-attribute 'fixed-pitch nil :family "FuraCode Nerd Font")
(set-face-attribute 'variable-pitch nil :family "Source Sans Pro" :height 120)

(add-hook 'text-mode-hook
          (lambda ()
            (variable-pitch-mode 1)))

(add-hook 'text-mode-hook 'variable-pitch-mode)
#+END_SRC

