init.el
  (load-theme 'spacemacs-light t))

(use-package doom-themes
  :init
  (setq doom-themes-enable-bold t     ; bold is universally enable
        doom-themes-enable-italic t)  ; italics is universally enabled
  (load-theme 'doom-one t)
  :config
  (doom-themes-visual-bell-config)  ; flashes mode-line on errors
  (doom-themes-org-config))         ; corrects (and improves) org-mode's native fontification

(use-package leuven-theme
  :disabled t
  :init
  (load-theme 'leuven t))

(use-package gruvbox-theme
  :disabled t
  :config
  (load-theme 'gruvbox-light-soft t))

(use-package poet-theme
  :disabled t
  :init
  (load-theme 'poet t)
  :config
  (add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
  (add-to-list 'default-frame-alist '(ns-appearance . light)))
;; main theme:1 ends here

;; [[file:~/.emacs.d/readme.org::*%5B%5Bhttps://github.com/hlissner/emacs-solaire-mode%5D%5Bsolaire-mode%5D%5D][[[https://github.com/hlissner/emacs-solaire-mode][solaire-mode]]:1]]
(use-package solaire-mode
  :hook (((after-change-major-mode after-revert) . turn-on-solaire-mode)
         (ediff-prepare-buffer . solaire-mode)
         (minibuffer-setup . solaire-mode-in-minibuffer))
  :config
  (solaire-mode-swap-bg)
  (advice-add #'persp-load-state-from-file
              :after #'solaire-mode-restore-persp-mode-buffers))
;; [[https://github.com/hlissner/emacs-solaire-mode][solaire-mode]]:1 ends here

;; [[file:~/.emacs.d/readme.org::*Modeline][Modeline:1]]
;; (use-package spaceline)

;; (use-package spaceline-config
;;   :ensure nil
;;   :config
;;   (spaceline-spacemacs-theme))

(use-package spaceline
  :disabled t
  :config
  (progn
    (require 'spaceline-config)
    (spaceline-spacemacs-theme)
    (validate-setq powerline-default-separator 'wave)
    (spaceline-toggle-minor-modes-off)
    (spaceline-compile)
    ))

(use-package spaceline-all-the-icons
  :disabled t
  ;; :after spaceline
  :config
  (spaceline-all-the-icons-theme)
  (spaceline-all-the-icons--setup-anzu)      ; enable anzu searching
  (spaceline-all-the-icons--setup-git-ahead) ; enable # of commits ahead of upstream in git
  )

(use-package doom-modeline
  ;; :disabled t
  :hook (after-init . doom-modeline-init))
;; Modeline:1 ends here

;; [[file:~/.emacs.d/readme.org::*test%202][test 2:1]]
(cond ((system-is-linux)
       (set-face-attribute 'default nil
                           ;;:family "Source Code Pro"
                           :family "SauceCodePro Nerd Font"
                           :height 90))
      ((system-is-mac)
       (set-face-attribute 'default nil
                           ;;:family "FuraCode Nerd Font"
                           :family "SauceCodePro Nerd Font"
                           :height 110)

       ;; Enable emoji, and stop the UI from freezing when trying to display them.
       ;;(if (fboundp 'set-fontset-font)
       ;;    (set-fontset-font t 'unicode "Apple Color Emoji" nil 'prepend))
       ))

;; Set a font with great support for Unicode Symbols to fallback in those case
;; where certain Unicode glyphs are missing in the current font.
;; Test range: 🐷 ❤ ⊄ ∫ 𝛼 α 🜚 Ⓚ
;;(set-fontset-font "fontset-default" nil
;;                 (font-spec :size 100 :name "SauceCodePro Nerd"))
;; test 2:1 ends here

;; [[file:~/.emacs.d/readme.org::*all-the-icons][all-the-icons:1]]
(use-package all-the-icons)
;; all-the-icons:1 ends here
