readme.org
**** org-mode config

#+BEGIN_SRC emacs-lisp :tangle no
(setq org-startup-indented t
      org-bullets-bullet-list '(" ") ;; no bullets, needs org-bullets package
      org-ellipsis "  " ;; folding symbol
      org-pretty-entities t
      org-hide-emphasis-markers t
      ;; show actually italicized text instead of /italicized text/
      org-agenda-block-separator ""
      org-fontify-whole-heading-line t
      org-fontify-done-headline t
      org-fontify-quote-and-verse-blocks t)
#+END_SRC

**** test 5

#+BEGIN_SRC emacs-lisp :tangle no
(set-frame-font (font-spec :name "Hack" :size 12) t t)
(custom-theme-set-faces 'user '(fixed-pitch ((t
                                              :family "Hack"
                                              :height 1.0))))  ;; was Luxi Mono
(custom-theme-set-faces 'user '(variable-pitch ((t
                                                 :family "EtBembo"
                                                 :height 1.2))))
(add-to-list 'initial-frame-alist '(line-spacing . 1))
(add-to-list 'default-frame-alist '(line-spacing . 1))

;; Replace the default line-extends-beyond-window symbol
(set-display-table-slot standard-display-table 0 ?›)

(when (require 'face-remap nil 'noerror)
  ;; Make available smaller changes in text size
  (setq-default text-scale-mode-step 1.05)

  ;; Set fixed-width fonts where needed
  (setq-default buffer-face-mode-face '(:inherit fixed-pitch))
  (add-hook 'calendar-mode-hook #'buffer-face-mode)
  (add-hook 'notmuch-tree-mode-hook #'buffer-face-mode))
#+END_SRC

*** all-the-icons

[[https://github.com/domtronn/all-the-icons.el][all-the-icons]] is a utility package to collect various Icon Fonts and propertize them
within Emacs.

#+BEGIN_SRC emacs-lisp
(use-package all-the-icons)
#+END_SRC

*** fontawesome

Insert fontawesome icons.

#+BEGIN_SRC emacs-lisp
(use-package fontawesome)
#+END_SRC

*** emojify

#+BEGIN_QUOTE
[[https://github.com/iqbalansari/emacs-emojify][Emojify]] is an Emacs extension to display emojis. It can display github style emojis like
:smile: or plain ascii ones like :). It tries to be as efficient as possible, while also
providing a lot of flexibility.
#+END_QUOTE

#+begin_src emacs-lisp :tangle no
(use-package emojify
  :hook ((after-init . global-emojify-mode)
         (after-init . global-emojify-mode-line-mode)))
#+end_src

* Enhancements

General improvements brought by some extensions to Emacs.

** beacon
Never lose your cursor again. Whenever the window scrolls a light will shine on
top of your cursor so you know where it is.

#+BEGIN_SRC emacs-lisp
(use-package beacon
  :config
  (beacon-mode t)
  (setq beacon-push-mark 35
        beacon-color "#666600"))
#+END_SRC

** crux

[[https://github.com/bbatsov/crux][crux]] is a Collection of Ridiculously Useful eXtensions for Emacs. crux bundles a
few useful interactive commands to enhance your overall Emacs experience.

#+BEGIN_SRC emacs-lisp
(use-package crux
  :general (("C-a"   . crux-move-beginning-of-line)
            ("C-c o" . crux-open-with)
            ("C-^"   . crux-top-join-line)
            ("S-<return>"   . crux-smart-open-line)
            ("C-S-<return>" . crux-smart-open-line-above)
            ;; ([(control shift up)]     . crux-move-line-up)
            ;; ([(control shift down)]   . crux-move-line-down)
            ([remap kill-whole-line]  . crux-kill-whole-line)
            ))
#+END_SRC

** expand-region

[[https://github.com/magnars/expand-region.el][expand-region]] increases the selected region by semantic units. Just keep pressing =C-==
until it selects what you want.

#+BEGIN_SRC emacs-lisp
(use-package expand-region
  :commands (er/mark-word
             er/mark-defun
             er/mark-sentence)
  :bind ("C-=" . er/expand-region))
#+END_SRC

** multiple-cursors

[[https://github.com/magnars/multiple-cursors.el][multiple-cursors]] for Emacs.

#+begin_src emacs-lisp
(use-package multiple-cursors
  :general
  ("M-s-s" 'mc/mark-previous-like-this
   "M-s-t" 'mc/mark-next-like-this
   "M-s-S" 'mc/unmark-next-like-this
   "M-s-T" 'mc/unmark-previous-like-this
   "H-m" 'hydra-mc/body)
  :commands
  (hydra-mc/mc/mark-previous-like-this
   hydra-mc/mc/mark-next-like-this)
  :config

  ;; from https://github.com/abo-abo/hydra/wiki/multiple-cursors
  (defhydra hydra-mc (:hint nil)
    "
     ^Up^            ^Down^        ^Other^
----------------------------------------------
[_p_]   Previous  [_n_]   Next    [_l_] Edit lines
[_P_]   Skip      [_N_]   Skip    [_a_] Mark all
[_M-p_] Unmark    [_M-n_] Unmark  [_r_] Mark by regexp
^ ^               ^ ^             [_q_] Quit
"
  ("l" mc/edit-lines :exit t)
  ("a" mc/mark-all-like-this :exit t)
  ("n" mc/mark-next-like-this)
  ("N" mc/skip-to-next-like-this)
  ("M-n" mc/unmark-next-like-this)
  ("p" mc/mark-previous-like-this)
  ("P" mc/skip-to-previous-like-this)
  ("M-p" mc/unmark-previous-like-this)
  ("r" mc/mark-all-in-region-regexp :exit t)
  ("q" nil :color blue)
  (" " nil "quit" :color blue)))
#+end_src

** zop-to-char

[[https://github.com/thierryvolpiatto/zop-to-char][zop-to-char]] is an improvement to the built-in ~zap-to-char~.

#+begin_src emacs-lisp
(use-package zop-to-char
  :bind ([remap zap-to-char] . zop-up-to-char))
#+end_src
