init.el

;; [[file:~/.emacs.d/readme.org::*fontawesome][fontawesome:1]]
(use-package fontawesome)
;; fontawesome:1 ends here

;; [[file:~/.emacs.d/readme.org::*beacon][beacon:1]]
(use-package beacon
  :config
  (beacon-mode t)
  (setq beacon-push-mark 35
        beacon-color "#666600"))
;; beacon:1 ends here

;; [[file:~/.emacs.d/readme.org::*crux][crux:1]]
(use-package crux
  :general (("C-a"   . crux-move-beginning-of-line)
            ("C-c o" . crux-open-with)
            ("C-^"   . crux-top-join-line)
            ("S-<return>"   . crux-smart-open-line)
            ("C-S-<return>" . crux-smart-open-line-above)
            ;; ([(control shift up)]     . crux-move-line-up)
            ;; ([(control shift down)]   . crux-move-line-down)
            ([remap kill-whole-line]  . crux-kill-whole-line)
            ))
;; crux:1 ends here

;; [[file:~/.emacs.d/readme.org::*expand-region][expand-region:1]]
(use-package expand-region
  :commands (er/mark-word
             er/mark-defun
             er/mark-sentence)
  :bind ("C-=" . er/expand-region))
;; expand-region:1 ends here

;; [[file:~/.emacs.d/readme.org::*multiple-cursors][multiple-cursors:1]]
(use-package multiple-cursors
  :general
  ("M-s-s" 'mc/mark-previous-like-this
   "M-s-t" 'mc/mark-next-like-this
   "M-s-S" 'mc/unmark-next-like-this
   "M-s-T" 'mc/unmark-previous-like-this
   "H-m" 'hydra-mc/body)
  :commands
  (hydra-mc/mc/mark-previous-like-this
   hydra-mc/mc/mark-next-like-this)
  :config

  ;; from https://github.com/abo-abo/hydra/wiki/multiple-cursors
  (defhydra hydra-mc (:hint nil)
    "
     ^Up^            ^Down^        ^Other^
----------------------------------------------
[_p_]   Previous  [_n_]   Next    [_l_] Edit lines
[_P_]   Skip      [_N_]   Skip    [_a_] Mark all
[_M-p_] Unmark    [_M-n_] Unmark  [_r_] Mark by regexp
^ ^               ^ ^             [_q_] Quit
"
  ("l" mc/edit-lines :exit t)
  ("a" mc/mark-all-like-this :exit t)
  ("n" mc/mark-next-like-this)
  ("N" mc/skip-to-next-like-this)
  ("M-n" mc/unmark-next-like-this)
  ("p" mc/mark-previous-like-this)
  ("P" mc/skip-to-previous-like-this)
  ("M-p" mc/unmark-previous-like-this)
  ("r" mc/mark-all-in-region-regexp :exit t)
  ("q" nil :color blue)
  (" " nil "quit" :color blue)))
;; multiple-cursors:1 ends here

;; [[file:~/.emacs.d/readme.org::*zop-to-char][zop-to-char:1]]
(use-package zop-to-char
  :bind ([remap zap-to-char] . zop-up-to-char))
;; zop-to-char:1 ends here
